package main;

final class I0II {
   private I0II() {
   }

   static Object[] II(int var0, int var1) {
      switch (var0 * 100 + var1) {
         case 0:
            return new Object[]{new Integer(-1000), I10_("飣頮颀餬饟螛餝馨駋蝩馈騪騍驈騣驢髦骞骺骕藆鬚鬻藙鯹鮖鮽鬗鱪鰒鰧鲐鳠鲎鲣鲄鷫鴊鶽鴆鷠鶆鷠鷖鸣鹀麫鸎鹟黮黕聿麒鼺鸨膛齗鿸鿝腹龝ꀲꁟꀸꀆ빉ꃀꃬꂝ뿯ꄉꄥ뾼ꇯꆅꆪꆋꋫ", 39087)};
         case 1:
            return new Object[]{new Integer(-1000), I10_("须颠颊餬餎饸饉颙駆馨馂騤鬲蒫騏髧骿鮯萾骕鬻魑鮵鬙鮝鯾鬶鮍鰳鱜鰹苕鳡鲎鳿鳌鵧莍鴧鵈鷱鵆鶪鷄鼒胡鹡鸎麌黷麝麿麓齯齀膟鼙", 39087)};
         case 2:
            return new Object[]{
               new Integer(-2),
               I10_("飬颡颃餬饝螡餈馨颶馯駅鬕髁騷驁髶葞骞鯌騏鬤鬰鬚鬗鯹鮖鮽鬗鱪鰒鵀苏鳡鲎鲿鵜鲪鵄鴮鵈鲖荵鷥鳵胀鸂鸭胅鸆麾黏麽鿪齻鼗齶齽龸龛龧龒ꁧꀑꅁꂜꂮꃙꂤꂞꄪꅁꄧ뿆ꇥꇍꇤꆋ벽ꉕꉠꍎ볓ꋨꊜꊯꊈꏳꍖꍷꌕꍷꏍꏳꋣ몼ꑅꑯꐚꓥ먋꒥\ua4caꐘ뮙ꔩꔁꖥꗏꖪꖃ꘠", 39087)
            };
         case 5:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "飻蘟颙餬饇蟥餄馤馇馴馄鬕驂驢騒落骿髙骴騆魫鬚鬺鬗鯹鮖鮡鮜芶鱋鱱鵡鴿艍鲮鳌鵧鲚莪鴆鷠鶆鶨鴅鹶鸂鸷麀鹟黪黕耟黛齶臈鼻齗腉龕龶鼙ꁼꀑꀷꂜꃭꂍꂸꂙꇫꅀꅂꄥꅤꇜꇤꆄꉫ볼ꉠꈼꈑꋳꊜꊳꈙꍠꌘꉆꌟꎵꏘꎦꎋ뫖ꑞꑯꐚ먠ꓜ꓁꒩ꕦꕆꕧꔎꕦꗝꗣꖐꙠꘀꘚ꙯ꙑꚼ롤\ua6fa\ua7e8\ua7ebꜗꜵꞆꞴ\ua7ddꞺ뤞\ua87eꡈꡮꠎ꣣ꣅ꣪ꢄ럑ꥄꥦꤋꧬꥁꦬ꧁ꩣ꩷꩑ꩽꨟꫴ\uaad4\uaaf9ꪔꭢꭏ떒\uab1aꮳꯆ땼ꮀ갯걊겾걦곃걉결곈갖돷괫굄귭귅괢귀귊긾깞긳긕꺺껔뀁꺔꼶꽛꼼꾑꿼꾑꾳꾇끡뀍낸뀅냭",
                  39087
               )
            };
         case 101:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "飻颦蘮餬饇螻養馨駄蜡馄騤驀騭騏骠髼鯗骳骛鬻魑鬱鮙鮷鯂蔄鮀鰙鱱鰾鰞鲯鱎鳡鳌鵯莋鴦鵈鷠茁鶫鷄鼒黀鸸鹀鸛鹼黓黼麗鿺齗鼿齗鿵腒龵鿓ꁱꁙꂪꀁꃩꂍꂸꂊꄪꅎ뿿ꄗꆦꇕꆬ뽀ꉫꈁꈶꊿꈗꊽꋟꊳꊏꍠ뷿ꌹꍼꏗꍞꎽꏒꑲ몑ꐡꐆ꒭꓀ꐫꒄꕮꔈꔳꔇꖥ꒵묚ꖖ꘡Ꙏꙗ\ua637ꚗ꛲ꚛꚢꚌ립ꝃꝶꜝꟽ르Ꞽꟑ\ua87cꥆꡮꠜ꣹ꡊꢣ\ua8c9\ua97e랊ꤲꥯ꧊ꥐꧢꦕꫠꩱꨞꨮꪝꫯꪚꪽꨚꭹꬖꬹꮔ\uabfdꯕ꯱ꮆ곯갎갽간걪겊겡겇뎦굏굥괊굷귌궦귀권낽깓깼긗깺껗꺿껗꽢꽔꽞꼰꿽꿟꿰꾇냭끔끬뀟끦냄냨뇶뇧녋넬녃뇡뇉넺놱놙눽뉊늻뉚뎈닝늺닖덣귵덳뉣덳돉돯돟됽됌됨뒋든뒈뗖됟땬딄딤떂떭떀떍뗾딉뙲뙜뙺똚뛰뙖뚣뛕띹럟뜼뜙랰럜ꥳ럍뤝ꛨ롪렍롨룉뢮룅렇륍륢뤅ꜧ맱릴룍뤞멢먚먵몘몷뫂ꑰ몙묳뭐ꗲ묞뮯몿ꔞ믌뱨ꋍ밨뱈볱뱟벫벃봣뵌붡봙뵓붾뷞붳붕븺빑뺻븎뺶뻍뺱뺞뼲븠ꆓ뽏뿺뽁뾡뿋섛\ude96쀦쁇삣삖샎삠셭셏셠센속솽쇈솳\udf39숹쉋\udcba쉖싱\udc51슽슕쌱숡\udde2쌛쎭쏘쎣\udd4d쑧쐈쐬쐎쓬쒄쒫\uda5d앵씀앷씎앝열엔\udb6d얚옸왼옟왙운웑\ud863욟읷윏윭잌쟯쟃쟪잇졠횂젨졅죲졃좭죁쥮짥쥊쥽줟쥨즚즱줔쩹쩞쩵쨀쫡쩓쪸쫐쭻쭇쬠쭌쯩쭀쮧쯈챠쳕찦채쳳쳊퉢첉쳟쵺첍펇촒춺췔촸춙츶칝캸츝컺캻캞캇콯콃켤콋쿦콃쾦쿋퀦탑퀪퀄킢톰퀳킶탞텱쾓턶텚퇫콫톾",
                  39087
               )
            };
         case 201:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "飻蘟颙餬饇蟥餄馤馇飗餜驭騃騥骁骠鮎驜骤髜魩藩鬰魔鮷鯞鮴鮜鱲鰜鱱鲤鳡鳉鳭鲟莶鴊鴧鳘荜鷈鶢鷄鹷肃鸨鹀齮聏黓麻黛齶臔鼹齗鿱脒龺鿓ꁹꁘꀱꁏꃭꃂꂢꃋꅩꇚꅨꄓꇮ뽦ꇤꃠꉬꈁꈢ볺ꈊꊽꋟ밲ꋚꍵꏂꌴꍖꏻꍔꎼꏒꑿ몏ꐺꑎꓠꓙ먚ꒄꔃꗨꕧꔅꗭꕅꖶꗂ꙯ꛀꙆ꙲ꙝꛪ롐ꚻꛙꝶ\ua7d4ꜯꝕꝠ\ua7ddꞵꟑꡳ\ua8dcꡮꠃ꣫ꣃꢯ\ua8c9ꥼꥏ럣ꤜꦤꦒꧢꦕꩩ뒠꩐\uaa3a꩜ꮊ둣ꪷꪟꬷꭚ떎\uab1aꮿꮒꮹ\uab1c걡걆걭갂곣괚곩겋귴괆굴굄귵댏궵귀궋깶냾깼급꼻껐껸꺃놷꽜꽴꽖꾧꾝꿰꾌끡끃끬뀃끩냐냨뇶꾹녋녤너뇫꽢놭뇿놊뉯뉝뉻눂닼닕닝늵덺덚덳댑닸돞뎨돎둮듟둫됞듡ꩫ듧뒂뗼땊딤땂뗵뗉ꭾ떳뗝뙲뜸똴똞뚸뛕꡵뚛뜴띇뜺랓럾랏뛟꤮렬롅뢨렇룯뢇뢎뢵뤨뤃뤉뤨릠맷맑Ꝫ릟먻멉꒰먛몷뮧먴몚뭻",
                  39087
               )
            };
         case 302:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "飬頽飍饩饆饪餋饡馇馲馗驫驍騥驁髰髷髗髽骈魳魏鬠薹鯹鮖鮧驕鱺鰒鰩鰅艞鳀鲪鳌鷫鴆鵩鶜鷩鷁鷥鶇胪鸂鸵鿐肠黰黚黼麗鿺鼙鼫鼖鿹龕龶黰ꁼꁖꁰꀌꃦ비ꃆꀿꅤꅎꅨꄔ뼻ꆅꃕ뽔ꉶꈁꈴꊵꈐꊽꋟꊳꊕꌹꍝꌺꍖꏻꍇꏳꎞꓱꐐꐈꐁꓦꓙꓧ\ua4caꕽ믃ꕧꔁꗬ뭹ꗣꖌ꛲ꘀꙌ룣ꙝ꛰ꙛ\ua6faꚍꝰꟗꜸꜝꞴꟅꞻꜛ\ua87eꠏ\ua83aꠟ꣣ꣅꢭ\ua8c9ꥯꥎꤧꥅꢕꥏꦬꦉꨠꩫ꩟꩗ꨲ꩸\uaac3\uaaf9ꨌꭹꭑꭵ\uab19땈ꯛ꯱ꮞ걧늃갣걌궚괚눪겋괧굒괬괊궣귁괲귀궝낹깄깼긖깹껗꺰껗꽢꽝꾮꽓꿪꿄녵꾛뀮끅뀥꺬냤낉낼깆녯넅널넑꼣뇌뇠놯놖뉴눜눯눒달닁갖늘댟덶궞댜뎱돓뎧댔둣둋둫된ꩢ듉듧뗷ꯐ딄딡ꮻ떡뗘뗊\uab0f떓뙻똛똮똋뙹뛞뛶럤ꦱ띇띲뙠꥓랏랺랟ꚯ렋렾렁롱뢇뢰뢌ꟃ륀륢뤂맯맱릞릮뤝멯먚먱ꓙ뫾몖몶몛뭽묒묲묘뭵므뮪믦뱈뱅밧뱈볯뱅벼별밒뵋뵡봔봖뵴뷈뷼붟빳ꃾ븬빗뻵뻝븮뺝뽵뼑빁ꆬ뾮뿊뾥뼑쁺쀉쀬삅샨삅삨쀃셬셆셠섫\udfdf쇴솜샊섉숹쉔숢슂싻슔슽슚쏸",
                  39087
               )
            };
         case 403:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "须颠颊餬饙蟯餝馨駓蜷駅马髃騭驁髶葞骞骾骓魵鬰鮍鬖鯰鮖鮶鮜鱼鰒鰲鰟鳡鲎鲮鲙菚鵄鵩鴊鵪鶆鶮鴉鹳鸂鸯麀鸆麾龬耟黛齴鿛鼶鼐龶鿖龵龜ꀲꁇꂥꁏꃦ빠ꂯꃡꅂꇊꄱꅇꇢꅜꆪꆄꈢꉒ벩ꈼꉞꋰ밝ꊵꊒꌹꍛ붰ꌗꎵꏙꌿꎜꑹꐐꐻꐜ멦ꒌ꒬ꒃꕨꕆꕧꔂꗬ뭣ꖷꗂꛠꙃꘟ\ua63c룞꛳ꚛꚬ렾ꜸꝓꞴꜛꞴ\ua7dfꜲꞟ\ua878ꠏ\ua82dꠂ꣢ꢋꢤꢁꧡ꤭꤄ꦇꧽꦃꦥꦈ득\uaa3f꩝ꨲꨒꪻ\uaad2\uaa3aꪁꬷꨧꬼꭔꯧ딟ꮡꯐ걣걛갴늫곥겊귘겁괫괆괮괌귪궂궯관궐긾깐냽긕껲꺙꺰꽖꽸꼕꼠꼛꽾꾑꾡꾚끯끔끬뀝깋낉뇙뀅녿넅놰넍뇥놁놧놶놟뉲눜눸눒닶늘늹늞덼귳댾덒돧굕돯뎃\uaad6둅둁땺든뒈뗖뒏딫딊",
                  39087
               )
            };
         case 503:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "须颠颊餬饙蟯餝馨駓蜷駅马髃騭驁髶葞骞骾骓魵鬰鮍鬖鯰鮖鮶鮜鱼鰒鰲鰟鳡鲎鲮鲙菚鵄鵩鴊鵪鶆鶮鴉鹳鸂鸯麀鸆麾龬耟黛齴鿛鼶鼐龶鿖龵龜ꀲꁇꂥꁏꃦ빠ꂯꃡꅂꇊꄱꅇꇢꅜꆪꆄꈢꉒ벩ꈼꉞꋰ밝ꊵꊒꌹꍛ붰ꌗꎵꏙꌿꎜꑹꐐꐻꐜ멦ꒌ꒬ꒃꕨꕆꕧꔂꗬ뭣ꖷꗂꛠꙃꘟ\ua63c룞꛳ꚛꚬ렾ꜸꝓꞴꜛꞴ\ua7dfꜲꞟ\ua878ꠏ\ua82dꠂ꣢ꢋꢤꢁꧡ꤭꤄ꦇꧽꦃꦥꦈ득\uaa3f꩝ꨲꨒꪻ\uaad2\uaa3aꪁꬷꨧꬼꭔꯧ딟ꮡꯐ걣걛갴늫곥겊귘겁괫괆괮괌귪궂궯관궐긾깐냽긕껲꺙꺰꽖꽸꼕꼠꼛꽾꾑꾡꾚끯끔끬뀝깋낉뇙뀅녿넅놰넍뇥놁놧놶놟뉲눜눸눒닶늘늹늞덼귳댾덒돧굕돯뎃\uaad6둅둁땺든뒈뗖뒏딫딊",
                  39087
               )
            };
         case 603:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "须颠颊餬饙蟯餝馨駓蜷駅马髃騭驁髶葞骞骾骓魵鬰鮍鬖鯰鮖鮶鮜鱼鰒鰲鰟鳡鲎鲮鲙菚鵄鵩鴊鵪鶆鶮鴉鹳鸂鸯麀鸆麾龬耟黛齴鿛鼶鼐龶鿖龵龜ꀲꁇꂥꁏꃦ빠ꂯꃡꅂꇊꄱꅇꇢꅜꆪꆄꈢꉒ벩ꈼꉞꋰ밝ꊵꊒꌹꍛ붰ꌗꎵꏙꌿꎜꑹꐐꐻꐜ멦ꒌ꒬ꒃꕨꕆꕧꔂꗬ뭣ꖷꗂꛠꙃꘟ\ua63c룞꛳ꚛꚬ렾ꜸꝓꞴꜛꞴ\ua7dfꜲꞟ\ua878ꠏ\ua82dꠂ꣢ꢋꢤꢁꧡ꤭꤄ꦇꧽꦃꦥꦈ득\uaa3f꩝ꨲꨒꪻ\uaad2\uaa3aꪁꬷꨧꬼꭔꯧ딟ꮡꯐ걣걛갴늫곥겊귘겁괫괆괮괌귪궂궯관궐긾깐냽긕껲꺙꺰꽖꽸꼕꼠꼛꽾꾑꾡꾚끯끔끬뀝깋낉뇙뀅녿넅놰넍뇥놁놧놶놟뉲눜눸눒닶늘늹늞덼귳댾덒돧굕돯뎃\uaad6둅둁땺든뒈뗖뒏딫딊",
                  39087
               )
            };
         case 702:
            return new Object[]{
               new Integer(-4),
               I10_(
                  "飧颧蘪饢餋餾蟈駡馇馣馈騤驕蓩騏骠髴髖萒骙鬻魛鬷鬐鮷蔗鯹鯔鱻鶓鰸鱐鳭艥鳭鲘鵹莍鴰鵈鷿鰖茞鶇鸣鹖麬鹀鸋黶鹉麵黛齴齑黨鼙鿱龕龿龛ꃦꁟꀷꁏꃽꃌꂣꃡꅏꅄꅨꄓꇮ뽔ꆧꇃꉱ볐ꉠꈼ볝ꋰꊜꍺꊔꌹꍙꌹꌞꎵꊥꌰꏒꑲ뫙ꐺꑎꓨ꓁ꓧ\ua4caꕧ뮗ꔲꕆꗮꗌꔷꖌꙦꘀꙜꚭꙝ\ua6fdꛕꚲꛙꝬꝟꞺꝕꟳ\ua7da뤏ꟑ\ua87e꣏꠷ꡍ꣯꧂ꢤꢎꤨꥌ꤮ꦑꧪ꧄ꧢꦃꩩ뒠ꩊꩽꨙ꫶ꪚꪪ둅ꬷꭂꬽ뗋ꮳꯜꬱꮟ갯걀늢갍겁걪곩겍굪괆괦궗궣귁괠궉귟깳껎긲깛껴깙꺡껛꼶꽁꼡꼊꾲꿟꼣꿏끥끅낸뀅냭낉낹낒뇧넅넣넊녣놁놴놭꼵눽뉒눳돊닷닟닷늓델댔댾댝돿돗돯뎏둣둄둫됄듡ꨅ뒩듆땦때딬땂뗤뗍떟떨떈뙵",
                  39087
               )
            };
         case 703:
            return new Object[]{new Integer(-2), I10_("须颧飍饮螊餤饉頩駎駪駅驷蓊騡驁鮑葞骞骶骔鯺魔鬾魘鯵蔗鮻鯔鱪芍鰤鱐鳣鱎鳭鲈鵤鴊鴫菉鷩鶆鶦鶌龳鹃鹡鸃鸗鼿黔黼鿪臉鼙鹉臒鿯龕龶腒ꁼꀑ뻱", 39087)};
         case 802:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "飬颦頌饹餋餾餛駩駎駦馆蓣驂驢骕髮髸骒髽骟魴魔魹鬔魷鯛鯵鬀鱽鱕鱱鰄艾鲎鲥鰌鵤鴊鴥菇鷪鶈鷥鶧鹬鹌鹡齱麜麾黟麵聄齮鼙鼼龎鿸鿒鿴龀뻻ꁒꁰꀂ븯ꃃꂤꃋꅩ뿎ꄩꅇꇫꅉꆪꆋꈢꌰ벃ꉿꈙꋴꉆꊫꋚꍲ붃ꍷꌏ봪ꏁꏙꎰꓳꑉꑯꐉꓤ멱ꓫꒉꕦꕆꕧꑷꕦꖄꖷꖐꞱ룿ꙑ\ua639ꙝꛨꛓ\ua63aꚗꝰꜗꜢꜝ륥ꟐꟲꞂ뛡ꠏ\ua83c뚾꣥ꢇ꣪ꠝꥦꥀꥦꤖ뜹ꦃꦠ꤁ꩮ\uaa3f꩙ꨴꨝꫴꪚꪺꪗꭹꬖꬹ뗕\uabfaꮒꮲꮘ걠갎걨걝겻겊곤곈굩굁공뎹귪궂궣덁궑긾깑꺾긎꺺껗꺿긗꽯꼕꼿꼛꽦꿟꾷꿏끩꺚뀼끋냩깎납냇뇲녋넣녩뇁뇎놮뇿놖닾뉅뉻눎뉵닕닷돧능귩댽댕뎱도괔뎇됭됉둺둛뒩듞됧듆땢ꯉ딪땂뗭ꭽ뗖뗾떞뙴뛛똵뙙뛻ꡐ뚷뛕럠띝뜵띑럤ꥴ랧럍론룈력롉\ua62d룞룦뢋륬맊륈롱맩릿뢯릴맜멸멕먷멖몹몘",
                  39087
               )
            };
         case 901:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飬颦頍饣餋餩蟄駽馇馤餌騨騃騡騉驡髪骞骾騏鬻魊鬱藛鯾鮖鮶鮜鳲鱇鱱鰞艖鳇鳭鰘鵥鵍鵩鵍鶵鶆鶵鶌肠鹋鹡鸋鸗鹪黓麻黄鼐齭鼹齗鿵黜龺龔ꀲꄠꂳꁏꃩ븚ꂼꃋꅩꅁꆩꄒꆦꆔꇤꆏ벥ꉏꉠꈷ벭ꋴꊜꊸꊒꏸꍍꍷꌕꍧꏚꏳꎐꓸꐐꐷꒃꓸꒌꐫꓠꕋꗊꔾꕆꗢꗍ묞ꗂꙢꙈꛞꘫꙝ꛱ꛎ렋ꚗꜸꝃꜷꝕꟺ\ua7db륿ꞟ꠰ꡌꠦꢌ꣹ꢋꢦꠉꥥ꤇ꡗ랢ꦤ꧗뜯꧁ꫠꨠꨞꨉꨝꪻ\uaad9ꮰꪖꭰꬖꬾ\uab1cꭧꯜꮶꯐ걭걇닲갘겫곞겡눙굤괆괩뎕균궂궢댇궞긾깞긴꺚껯꺙꺰꺞뇑꽛꽴꼇넳꿘꿰꾁끦놝끬뀅끪냆냨낉꿩년녎넠뇪녀놵뇿놜담눜눳늙닠늘돆늟댵눥뎲댜돹뎐뎢굋둴됌됨됅듧뒈듢듗딷딄ꮜ땂뗰뗕뗞떰떕똼뜪뚸똀뚸뛃뚾꠶뜴띛뜻ꦶ럾랏랺뜍롥렋려륪룦룀룦뢓매뤃뤶뤀릠맬꜃맽릟면멓멹먖뫿묆뫵믥믠묒묽뮐뮯믆ꔀ뮏밫뱚밡벅벧볈벭밍",
                  39087
               )
            };
         case 1002:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飻蘟颙餬饇蟥餄馤馇馤餇驽騃騥騈葝骿髝骲骒鬻騫鮺魘鯴鯞鬸鮚鱻鰒鰥鰘艦鳍鳭鲘鵹菵鵩鴜鷯鵆鶫鶌鸣鼳肆鹀鸋聳麝麿耜齻鼙鼬鼖龜鿡龵鿓ꁡ뺌ꁰꀋ븯ꃔꃬꂈꅥꅇꅨꅖꆦꇑꆱꆚ볅ꉕꉠꈼꈖꋴꉖꊮꋚꈈ붏ꌴꍖꏷꏝ봔ꎆꐱꑓ모ꐏ꒭ꓘ꒪ꓠꕋꗊꔾꕆꗢꗍ묞ꗂꙢꙏꙑ꙾ꘕꙿꛂ\ua6fa\ua7e8ꝱꜗꜽ맊\ua7e0ꞓꞰ륐\ua87eꠏ꠸뚶꣥ꢋꢤꢁ럧ꥉꤡꥅꧪ꧄ꡲ뜼ꩩ\uaa3fꩆꨨꨒ\uaafcꪚꪨꪍꭶꭘꬽꭔꪂꭐꮨꯐ괞걇걡걌곿곂갣겅괧괗굥괊귤값댜궉귟깼난긲깛껸끢꺬껗꼧꼕꼿뇈꾲꿅꾸꼖뀮끀났끋냩냆낦냭녋뇅녤넏뀲뇔뇠넢뇞뉱닜뉻눎닫뉙늹늞댵덟귬댆뎱돒굮뎀됭둚ꪐ됃뒩듆뒯ꨉ땫땃땣딌뗦됐ꭢ떷뗝뙿뛈뙺똛뛹뛙뚱뛕라ꧪ뜻띑럾럇뜧럁렬롃ꚇ롉룣룏렲뢋륣뤃뤮릁릠맴꜅맽릈멳뫃멹먛믾뫘몲뫔뭸뭚뮥묞믨뮎뮣묆뱥밊밥번벧별ꉤ벊",
                  39087
               )
            };
         case 1103:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飨颧蘰餬頺馨餐馨駟餥駅驣驊騣騎骠髼葙骼髜魸魕鬷魘骆魕鯵鮀鱺芍鰿鱐鳭艷鳭鲄鲪鵄鵩鴚茢鷒鷥鶊鹫鹋肀鸕鹟黬聮麵黱齘鿛鼡齗鿱鿜脉鿓ꁱꁞꀾꁏꃦꁎꂵꃋꅼ뿨ꅨꄉꇮꅅꇤꆛꉫꉏꉠꊫꈐꋺꊜꋾꋈꌹꍊ뷦ꌘꏲꎔꎰꎝꑿꐐꐼ뫓꒭ꓚꐫꒅꔩꕊꔦꔈꗢꖄꖫ묻Ꙩꘀꙑ\ua636ꚔꚖꛯꚻꛙꝫ맔ꝶꜙꝷ\ua7dcꟲ륔ꡩꠏꠥꠅ\ua878ꣅꢭ\ua8c9ꠙ럴ꤨ꤂ꦤ\ua95eꧢꦍ뒡ꩶꨞꨬꨉ\uaafa\uaac3\uaaf9ꪋꭶꭘꬲꭔꯧꯀꬰꮓ걧갎갠겟골겊겪갉굮괆괱괌굡귌귡궇궖껾긝긲꺛껣꺗껶껽긆꽜꽴깢꿻꾑꾳꾀끠뀁끬뀅끹냀냨낌녮뇌넫녃뇮녂놯뇿꽛뉤눜눵눒뉰늖",
                  39087
               )
            };
         case 1201:
            return new Object[]{
               new Integer(-2),
               I10_(
                  "飬颡颃餬饆餿螸駦馇馲馍驥驎驢騆髩髾骞骫騜魴鬚鬻鬙鯹鯑鯵鮜苊鱛鱱鲑鲰鲎鲅鲍鵢鵐鴳鵄鶧鷅鴤鶍鸣鹎麢鸏鹟黹黔鸼黛齴鿙鼡齗鿺脔龽鿓ꁶ뺐ꀩꁏꃦꄝꃬꂈꅢꇈꄽꅇꅲꇋꆣꇃꉰ볲ꈩꉕꈽꋲꋒꋻꊗꍬ뷩ꌹꍖꏡꏜꌿꏒꑲꕙꐡꐉ꒭ꖽꕻ먉ꕪꔈꔳꔎꕱꗍꗯꗂ꙯Ꙉꞏ\ua630ꘚꚼꛘꚵꚗꜸꝇꜾ맖ꟽꞓꞰꞘ뚯ꡛꡮꠁ뙽\ua8ca꣪ꢊꥠ럪ꤨꥅꢕꠓ뜡ꦂꨠꩽ꩟ꨳꨛꪻ\uaad2됀ꪑꬷꭘꮵ\uab1bꮳꯆ딀ꮄ갯괿단강겫계겡각괩괈굏굊궭귚괢귀궗냇깔깼긕깺껀껸꺔꿥꼕꼺꼛꿻녰꾥꿏끺끅났뀅냢낉낸낏꾡녋녤넏꼭뇌뇬뇿놝덴뉒눼뉚닺닐갞닖덣돘덳댓돿뎐뎡뎉둸둕둫됉ꩮ듉듧뒅땪땊땣딌땫뗎떟딪떓뙻똛똹똑ꡑ뚗뚴뚜ꦫ띇띲뜕ꤧ럁럮랉룾렋렼ꛄ룱뢭뢅뢍맾륀륢뤂맯맱릞린릝멢먚먴ꓗ뫹몖몡몆믹뭜뭱묓믠므믭뫽붻ꋷ밧및벧볅벪벊봣뵁봩ꎭ봑붲붝붱봛븺빕븭뺃뻸뺕뺺뺛ꇉ뼑뼢ꇞ뿠뿊뿬뾈쁥쁇쁨쀗샮\ude06삭샃셮쇁셠셮셞쇾셈솵솝숹쉜습수습싀\udc02슆쌱숡\uddea쌗쎭쏂쎣쌃쐧쐆",
                  39087
               )
            };
         case 1202:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飬颻蘼饥餋餩馐駦駀駦馉髧驌驢蓄髹骿髝鮴骒魼鬚驈薫鯹鯑鯵鬉鰳鱀节鰙鲯鱎鳲鳌鵟菻鴽鵈鷫茉鶨鷮鹁黀鸸鹀鸘黷聠黼麘齵齗齸鼟齵鿌鿴龐ꃫꁟꀷꁏꃠꃅ븣ꂅꅭꄉꄦꄀꀶ뽸ꆭꇃꉠ벀ꈮꉿꈝꋲꋒꋻꊌ뷲ꍙꍷꌝ봪ꏀꏳꎐ몰ꑞꑯꐚ먬꓃ꓫ꒞ꕡꗈꔩꔎꖥꖕꗣꖀꙠꙎꙘ꙾ꚝ롅ꛒ\ua6fa\ua7e8ꝱꜗꜸꜝꝽꞹꞙꞙ\ua879ꠏꠠꢍ꣣ꢋ\ua9db똎ꤨꤒꥦꤑꧬꥃꦬꦉꨠꩩ꩗ꪷꨒꪻ\uaad8ꪸꪖꭰꬖꬽꮗꯪꮒꮥ딫걦갎굜겎곲겊경겉괧굕굥굄궣귋궠궏귟깰깕긵낼껷꺙꺮뀒꼶꽖꼼꼜꾲꿅녵꾛뀮끎껯끋냩끈낫냇녥녊넪",
                  39087
               )
            };
         case 1301:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飻蘟颙餬饇蟥餄馤馇馥馊驪騃魓骂骠髼驍髽骒魳藕鬷鬟鮷鯘鮲驄苎鱛鱱鵡艜鳀鲪鳌鰚菳鴠鵈鷬荧鷥鶒鹢鹋鹡鸓麞黪麝麿鸚齴齑齸鼅腅鿜鿞龱ꃰꁈꁰꀈꃧ빰ꃬꂈꅥꅇꅨꄑꅦꆅꇷꇃꉬꉆꏰ벂ꈗꊽꋔ밖ꋚꍱꏛꌮꍖꏡꏜ봐ꏒꑹꑙ몈ꐀ꒭ꓘ꒢ꒄꕡꔈꔳꔎ묢ꗊꗣꓳꙮꛀꙑ꙾ꘖ렣ꛏ\ua6fa\ua7e8ꝱꜗꜸꞕꟻꞹꞑ꜐ꡳꡇꡮꠝ꣤뙺ꢣ\ua8c9ꥠ럄ꤶꥅꧪ꧋ꦣꦔꨠꩳ꫞ꨰ꩜ꫵ\uaad2ꪰ됿ꭺꬖꬣ떑ꮿꮒꮲꬑ걬걆걭갏괻겊겱눅괧교뎞괍궣귌궩궁궊긾꼬꺯깛껶깙껸꺟꽿뇲꼺꽓꿦꿙꼲꾁뀮끎꺫뀊낪냝뀪낊넦녑놩넍뇪놁놭꼈놗눽뉒눼돊걄닑닝늵돴덗덳댑돾돞돯뎆듮둕둫땻꩘듁듧뒈땭뗆딭땂뗹ꭍ떟떪떕ꢣ똛똬ꢢ뛱뚗뚸뚝띵띆띾띑럸띌랷럍롯룒려렎뢨룏꘥뢕뤤륐Ɜ뤂릠맫맗뤷릉먻멞먰꒿뫣몖몹뮝묳뭃묤뮑믦뮎뮻ꕁ뱿밊밧밀뱮",
                  39087
               )
            };
         case 1403:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飨颧蘢饥餋餦蟆駥馇馥餄驧騃騡騎髮骾骴髳髒鬵魲鬰薿鯹鮖鮡蕕鱺鰒鰲鲃鲯鳘鰭鲅鴫鵉鴡莏鷩鷁鷥鶕鹶黃鸨鹀鸉耳黉黼麖臁齐齸鹦腃龕龶脪ꀲꁝꂺꀁꂮꃅꀬꂅꅢꄉꄼꄎꇨꇍꇤꆀꉪꋛꈮꈸꉞꋩꋝꋑꊹꍶꍖꍷꌞꍶꏍꏳꎑꓨꑞꐨꑎ꒾ꒌ꒥\ua48d꒹믵ꔮꕆꗱꗖꖬꖌꙦꘀꙝ\ua63fꘓ\ua6fbꚛꚶꘓꝶꜗꙇꛅ륉\ua7ddꞵꟑꡤꡆꢤꠘꢬ꣏ꢣ똮ꥼ꤇ꤥꤍ\ua97e꧍ꦥ꧁ꩮ꩷\uaad7꩗\uaa38꩹\uaad4\uaaf9ꪛꭿꯌꬻꬓꮳꪣ땦ꮄ갯걀갤늭곦겊경겁굩괆괳궄귬궂궢괁궜긾깞긳긕꺺껑끧꺃꼶긤뇱꼊꾼꾟꿚껿끧뀍녝뀂낤낇냦",
                  39087
               )
            };
         case 1503:
            return new Object[]{new Integer(-5), I10_("飨颧蘢饥餋餦蟆駥馇馥餄驧騃騡騎髮骕髽騯骒鬻鬋魹鬎魷鯟鯵鮗鱼鱜鱱鰁鳺鱏鲤鳌鵽莇鴽鵈鲖茁鶰鷄鹰胭鹡鸎肐黿麷麟麔齴鼙鼰龔鿯龕龠龚ꃸꁄꁰꀋꃧ빪ꂸꃋꅤ뿸ꄼꅇꇥꇍꄾꆍꉥꈁꍑꈶꉞꋳꋔꈲꋔꌷ", 39087)};
         case 1603:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飬颡颃餬饟餢螘駫馇馵蜔騤驏骢騌骠髫髟髽骒魼薛鬺魘鯹鯞鮼鬞鱽鰒鵀苕鳶鲂鳭鲇鵣鷞鴧鴏鶧鷓茐鶊鹤鸂鸢麔鸑黹麝麨麚鼺齍鼪鼂鿯腴龺鿓ꁶ뺐ꀩꁏꃸꁘꃬꂈꇾꅇꄯꅭꇄꅏꆪꇃꉬꉆꈯꊿꈗꊽꋟꈩꊔꌹꍊ뷲ꌂꎵꏚꎻꎛ뫐ꑅꑯꐅ먶ꒌ꒿ꒂꗰꔈꔩꔁꗰꗝꗣꖊꙨ룣Ꙓ꙲ꙝ꛲ꙑꚴꛙꝻꝘꜸꝕ\ua7e4\ua7db륱Ꞙ꠰ꡄꠦꢙ꣢\ua8cc꣪ꢇꥯ럌ꤨ꤂ꦤꧏꦷꦘ듇ꩱꨞꨩ듑ꫫꪚꪷꪐ\uabfeꬼ\uab19뗕\uabfaꮒꮲꬃ갯걍갥같곲뉭겧곈굿뎅괼굄귱귃귡궒댬깷긑깼길껯껐껸껚꼶꽘농꼇꾲꿟꾷깟껓끄끬뀃깇낉날뀇녨녂녤넛뇣놁놣꼸놟눽뉔겖뉚닱뉘늹늑댵덀댲덒뎼뎐닞뎏둣둋둫됍\uaa3e듘듧뒅땭땑딺ꮥ뗯떪뗼떱떓똼뙓뚹똀뚸뛃ꠍ뚜뜴띇뜺랑럾럇럮랝롤\ua6fa롪렿룭룀뢣뢑륥뤃뤪Ɪ맩릿맊릵룿멶먚먭몔뫹뫞뫵몜믿뭜묹뭐믬ꔃ뮸믌뱿뱋뱩밆볯뱏볤별밓뵋뵡뱱봖붾뷞붳붕븴븗",
                  39087
               )
            };
         case 1701:
            return new Object[]{
               new Integer(12),
               I10_(
                  "飬颦頍饣餋餩蟄駽馋駦馆蒩驖驢騍驠骿鮯萚髜魯藗魹鬛蕰鯗鯵鯑鰢鰂鱱鰀鳧舍鲤鳌鵠鵂鶽鴆鷠鶬鶇茩鹭鸂鸯鸇鿏聃黔黼麕齽齖龸鼞龶鿝鼴龝ꁺꀑꀤꀆꃠꃅꃬꂈ뾭ꅄꅨꁶ뼡ꇐꇤꆁ볝ꉈꉠꈫꊔꋳꊜꊝꊓꍽꍝꍷꉧꍶꎔꎥꌒꐱꔡꐮꐀꓪꒌꗚ먿ꔩꕊ뮞ꕆꗳꕄꖬꗂ꙰ꙕꛕ꙾ꘕꜬꜚꚴꚞꜸꝔ릱꜔ꞴꟇꜦꞘ\ua83eꠁꡄꡃꢢ\ua8c8ꢢꠓꥦꥀꥦꤑꥤ꧍ꧢꦒꫡꩫꨞꨵ듃ꫯꪚꪽꨚꭹꬖꬹꮔ\uabfdꯚ꯱ꮆ곯갎갥늋곲겊겡겇뎦굏굥괕귶굈귡궈걏꾿깓긻깛껹껑긢꺙꽱꼕꼠꾇꿻꾻꾓녂끻뀍뀤낈냳낉낯낎뇼녕녤넗녶뇈뇠뇮뇞뉩뉝눢뉚닭닑눽늃댵덐댺궵돥뎐뎭괣둣됌됨됂둳듆뒠듆땫때떪",
                  39087
               )
            };
         case 1805:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飬虭颀餬颊餤饉駫蜊馳駅鬕髀驢騉著骿髊骯萟鬻魎鮭鬑鮷鯂鮼鬞鱦鰒鰵鰙艈鳚鳭鲎菆鵄鵩鴄鵪鷈鶭鷄鹷鹃鸸鹀鸌黿黔黼麽齳齝鼽齽龥龕龠鼙ꁼꀑꀳ뻈ꃣꂍꇝ빌ꅿꄉꄫꄏꅼꇋꆣꇃꌓꉀꈮꈸꉞꋩ뱕ꊸꋚꍾꍑ뷺ꌘꎵꏘ뵼ꎟꐽꐐꐻ꒚ꓤꒌ꒿ꒂꗥꔈꔬꔎꕱꗊꖤꗂ꜐룇ꘟ\ua633룜꛲ꛓ\ua6fa\ua7e8맛ꜗꜵꜝ륅\ua7ddꞵꟑ\ua87c뚎ꠧꡍ꣮뙦ꢤ\ua8c9ꥫꥏꦼꤋꧣꦩꧬꧏꨮ",
                  39087
               )
            };
         case 1903:
            return new Object[]{
               new Integer(-5),
               I10_(
                  "飬虭颀餬颊餤饉駫蜊馳駅鬕髀驢騕髩驵髋髽骘魲藽鬭魘鯰鯟鬯鮄鰳鱆鲥鰙鲯鳂鶤鳌鰚菭鵩鴜荪鶆鶦范鹢鸂鸇鸉鸛黻麷麘齋臁齐齸鼃鿤鸅脏龝ꁵꀑꀖꀆꃪꃈꃬꂈꇸꅇꅨꄄꅵꆅꇵꇃꌓ본ꈩꉿꈙ뱎ꋑꋻꋏꌹꍌꌿꎖꏻꏜꏳꎄꑸꓚꐡꑎꖜꔜ먨ꒉꔩꕋꔯꖜꗫꗃꗣꖅ료ꙉꘟ\ua632ꚝꚼꛯꚳ렸ꝭꜗꙆ리ꟽꞓꞁ꜐ꡤꠏꠚꠅ뙫ꢡꢉꢁ꧲ꥉꤡꥅ꧶뜆ꦶ꧁ꩭ뒾꩐ꨵ꩜ꫭ\uaa5a\uaaf9ꪊ떲ꭂꭵ\uab00ꯡꯇꮿꮗ갯걚갥게곥곂곩겞돜굏굥괐굩귌귡궦궖깺깘깖긹끗껗껸꺔꽾꿏꼺꼔꾲꿇넻꾎뀮넼뇼꺈냩낉낫긊넦녑꾟넊놢낰놩뇿놊뉯겟뉻눎닱뉁닷늕덽덛덳덁뎱도댥뎀됭딽ꪌ둊듽ꩅ듧뒅ꮨ땑땣디꭪뗁떟떪떔뛶뙎뙺똝뛱ꡰ뚢뛿띜럐뜫띑럳럇ꤟ랃롫렋렦ꛈ룡뢇뢤꘨륪뤃뤡뤉륺맱맙맽릛멲뫀먩멘뫣멂몼뫔뭽뭚뮸뭞뮡뮀믣",
                  39087
               )
            };
         case 2006:
            return new Object[]{new Integer(-5), I10_("飡颜颢餬饤餌餯駄駮馈馠", 39087)};
         case 2104:
            return new Object[]{new Integer(-5), I10_("飡颜颢餬饤餌餯駄駮馈馠騎驭騐騮骠髐髸骛骰魒魴鬜魲鯙鯤鮚鯔鱜鱴鰗鰼鳆鳠鲈", 39087)};
         case 2200:
            return new Object[]{new Integer(-2), I10_("飻蘟颙餬饇蟥餄", 39087)};
         case 2202:
            return new Object[]{new Integer(13), I10_("飻蘟颙餬饇蟥餄", 39087)};
         case 2203:
            return new Object[]{new Integer(37), I10_("飢颯题餬頺餣饉駼駎餬馐騤驇騫蒦髴骿骏髭髌鬫鬚鬡鮒鯹鮖鮶蕑鱣鰒鱠", 39087)};
         case 2205:
            return new Object[]{new Integer(37), I10_("馿虱颃餬饿餢馉駦駏駦馵马蓲驢騱髨驲髟髽鯬鯯魔鬾魘鯣鯟鬿鮁鰳鱖鰸芷鳻鲎鲙鲃鵠鵟鴭鴉鶧鵆鷥鶊鹫肅鸬鹀鸻黬麓麗麔齨齜齸鼁齶龕黅鼓ꁼꀑꀵꀂꂮꃎ븫ꂊꄪꅁ뿧ꄉꆨ", 39087)};
         case 2304:
            return new Object[]{new Integer(37), I10_("飭蘃颃餬饪餤餍駺駈馯馁騤鬲骡驁髸髪萛骩髜魳魓薞鬖鮷鯂蕴鮝鰳鱁鲳鰞鲯鳝鲬鲙鴫鵙鴠鶂鷲鶆鶱鶌胈鸂鸬鸁鸊麾龬麵黛齮齋膳齗鿽鿝脹鿓ꁱꁙꂪꀁꃩ", 39087)};
         case 2404:
            return new Object[]{new Integer(37), I10_("飾颻頌餬饌餢馃馨駀蜝馈騤騞驫驈", 39087)};
         case 2505:
            return new Object[]{new Integer(37), I10_("飬馧颃饫餋餸餈馨駀餪駅鬕蒆騻驀骠體髖騴骈鬻騫藼鬁鮷鯘鮽蔵鰲", 39087)};
         case 2605:
            return new Object[]{new Integer(37), I10_("飧頭颔餬頺蟵餇馨駑餳駅鬕髃騫驁髸驵髐髽骞藖鬚鬱鬍鯹鯑鯵鮂鳳鰒鰥鰙鱥鳛鳭鲈鵢菭鴽鵈鶰鶆鳔茍鹢鸂鸢鸏鸑麾點耻麚鼺齗龫", 39087)};
         case 2700:
            return new Object[]{new Integer(18), I10_("飻蘟颙餬饇蟥餄馩馇馄餇驽騃騥騈葝骿髝骲骒鬻魒鮺鬁鮷鯂鬹鮙鰳鱑鰹鰟鲯鳚鲬鳌鴾鴚鵹鵈鷱鷏鴯鶊鸣鹁鸠鸐鸌黫黑麩麞鼺齒龴齗鿴齘", 39087)};
         case 2705:
            return new Object[]{
               new Integer(37),
               I10_(
                  "飹頮颂餬饇馰養馨首駴馍騤驗騰鯑髡骿髝騼骟鬻魔鬾鮘鯮鮚鯵鮖芲鱜鱱鵡舰鳀鳭鲋莼鵚鵩鴦鷗鷥鷥鴰鸣鹑鸨鸎鹟黪耜麵黛齷齘鼨齗麆脔龽鿓ꁺ뻨ꀹꁏꃸꁘꃬꂟꅢꅜ뿥ꄓꆨꆅꆷꆂꉷꈁꍑꊬꉞꋿ밝ꊵꋚꈈ붇ꌹꍖꏶꍕꎰꏒꑥ몗ꐡꐉ꒭\ua4cf먬ꒋꔩꕅꔦꔖꖥ꒵묀ꗂꙵꙉꛕꘫꙝ\ua6f8ꛒ렝ꚍꜸꝔꞷ꜖Ꞵ\ua7de뤷Ꞓ꠰ꡛꠧꢇ꣹ꢑꣀꢡ랩꤇ꥴꥐꦤꧧꦰꦀꩢꩪꩌ\uaa3cꩶ\uaad3됛\uaaf9\uaacaꬢꬖ\uab17ꬁ\uabfaꮒꮓꮅ걦갤갅닍겫겘과곈굅굓괬굄귁귗궨귀궓낹깓깼깉꺐껱끹껗꼤꼀꽴꼪꿳꿒꾿꾁뀄끥껭끋낸난냨낣녴년넦넖뇰뇀뇠놳꽙뉳눜뉩뉰닑같닷닃댥댔댞댓돳눀",
                  39087
               )
            };
         default:
            return null;
      }
   }
}
