package main;

public final class IO__ {
   public static final String lIl1 = "1.0.2";
   private static final int[] I_ = new int[]{4, 3};
   private static final String[] Il1_ = new String[]{I11("☓☊⛨♊⛑⛾⚟㦿❕❺❈➶➇⟸⟇", 9795), I11("☓☊⛨♊⛑⛾⚟㦿❕❺❈➶➇⟸⟄", 9795)};
   private static final String[] Il1O = new String[]{
      I11(
         "☓☪⛈♪⛱⛾⚿㦾❵❺❈➶➇⟸⟇⠞⠹⠖⠾⣑⣡⢆⣍⥘⥹㟪⤠⦨⢷㜞⦦⨤⩭⨊⪢⫎⪕⪞⫽⫑⬻⭷㖆⭘⯣㔗⮼⯔ⱗⱝⰰⰞ⳧ⲎⲙⲞ㎪ⵃ\u2d69ⱸ㍞ⷅⷥⶪ\u2e6b⻁ⸯ⹀⹗⻳⻜⺬⻛⼯⼊⽸\u2e66ㄩ\u2fdb⿴⿅〠〘なくユ⸌レゃ⾵ㅝㅨㄖㇳㅄㆭ㇃㉴㋁㉠㈼㊟㋾㊜㊯㍊ⷂ㍖㌰㍖㏡㍕㏳㏚㑳㑟㐼㐝㒭㓈㒤㒋㕧㕀㕧㔒㗷⬅㖪㗋㘡㙒⣬㘷㙝㛻⠌㚪㛙㘈⧮㜵㝕㟚㟛㜱㞟㠰㤾⚍㡍㣸㡇㢧㣉㥦㥀➋㤆㦤㧑✑㦏㩧㨕㨞㩽㩑㪻㮪㪰\u2439㭢㬖㬾㬝╔㯜㯱㮆㳯㱁㱷㱌㳨∍㲧㳈㵤㷕㵥㴆㷢㷌㶦㷀㶗\u20c7㹔㹼㸍㹺㺙㺿㺞㽷㼕㼺㼛ℿ㿁㿰㾍䁯䁃䀫䁋䃢幰䂡䃇䅲䅗䆮䄍䆢䆐䇠䆱䆙䋽䉅䉠䉚䋷將䊢䋖䍶䍜䋣䌓䎱䊡崨䏎䔜䑅媊䐟䒩䓃䒮娡䕫䔈䕣䔁䕲䖀䗋䖶嬾䘼䜪䚠䘍䚸䛛䘥䚁䜴䝟䞿䜟䟸䞏䞭䞌䡢䡃䡪䡁䣆䣷䢅䣅䥇䧑䥢䤥䧯䧾䧐䦵䧜䩏䩈哸䨑䪾䪖䫤䫙䬦䬒䬥䬘啀䯇䯭䮚䳫䱄䰮䱈䶖剥䳥䷵䲳叁䴢䵀䴉䵾䷒䷼䶉乳仓丶丐亶亄仴亟亢凒伤佥侮侍信俋假仾倡假僨僂値傚儢兂儨侖兞傌倌伸写刹剎劷则劵劅勳办䶶卞卣华叠䵻厢及呥喘䪤吒咥哇吰哂唲唐唟售唕啦嗏嗺哨䣛嘗均嚔固四囘囑地圂坮圾埭埞埪垂塠塎塦堍䘥境墪䙞奴夿奏夨妝姲妚妯夘娷婂寥䒯嫽嫕嫱媄寮嬂孭嬋䔼寚審嫸䋞居履尪峫屁岯峀岌䎣崝崿嶈嶺嶈巸嶇幾廏帠幓徃䁲廰庛忢彀彬弝彪徉徦徏纱恑恤怍惥繬患惿悌翎慒愼慚憱憌懷惧粪扚扳扅抱拃抮抁挤挀捫挂紶揜揧掁摬竹摣搑稼撀擝稕擝損撋攻教旮筶旜",
         9795
      ),
      I11(
         "☓☪⛈♪⛱⛾⚿㦾❵❺❈➶➇⟸⟄⠞⠹⠞㚷⣞⣧⣮⢮⥄⥪⤞⥣⦨⦇⧫⧅⩦⩌⨱⨒⪺⪿⫓㐂⫝̸⭿⭛⬷⬐⮷⯅⬴⮗ⱻⰒⰳⰟ⳼ⳝⳇⳌ\u2d2bⴇ\u2d69ⴌⷮⷒⶭⶁ\u2e6c⸘\u2e61⽱ジ⺾⻉〱⻛⸋⽐⽸⼃\u2ffe⿐⾻⿹〲】ぽくレヌィゝㅯㄓㅨぶ⽁ㆅㆰ⼎㈢㉃ⳣ㈰㉞㋫ⱻ㋑㋚㌹㌕㍷㌂㏴㏚㎰㎝㑿㑗㑵㑎㖜⩫㓫㒞⯤㔈㔳⯃㗫㖄㖠㔖㙯㙇㘵㙾㙝㚱㚛㚸㚐㝽㝙㜾㜜㟺㟛㟨㟑㤁⛨㡮㠙♡㢋㢨㢀➷㥉㥦㤍㥨㧍㦪㧁㨨㩒㩟㨿㯌㪷㪚㪌㪍㭵㬚㭵㬿㯺㯖㯱㮺㱦㱜㰨㰂㲢㲠㳃㲪⎥㵨㵥㱴⍑㶂㶊㶨㶰㸾㹿㺝㸮㺐㺙㻸㻚㼶㽣㾴㼜㾲㿅ⅱ㾆䀮䁼䀹䀒䂪䃥䀫䂈䄦䅮䄥䄎䇧䆍䇠䆲弛䉾䈜䈐䈒䋶䊘䊵䈗䍠䌔䌷䋂嵊䏙䏯䎌䑤嫯䐥䑐䒩䓋婠䒈䔥䕇䖰䕂䗣䗁䗑䖹䗝䙴壢䘳䙕䚸䛄堿䚖䜴䝞姳䜟䟸䞏䞺䞟䣦䡅䡪䡛䢨䣓嘱䣅䥲䧃䥢䥐䦠䧽圝䦳䧜䬊哩䩹䨓䫿䫙䫵䪖䯲䭇䭽䭐䯻啿䮤䯌䴚䱋䱩䱛䲧䳊剢䲊䴣䵏厖䴉䵟䷰䷚䴼䶂丐丙乸乚亶件亼倾佼休伳凊俾侍仝儲倪偝亣假傷傅凕乜公儁共兮兎冱农冸佟剩刘刴劖勻勓勳劑印卟卯匟司卍厢及呪哈吩吁咥哉䩢和啩唀啉喾啝嗬嗓䭽喗嘸噃嘾埅䡋囝嚵囑坳埏圠圊垬埅垢垀䛉塒塌塅墤墎壢墢姳夿堯䞎夒姼妚妱䜫娷嬧䓪娙媳嫕媸䐭嬣嬎嬥䗓寿宊宮宁䋚将尭尋䈴峁峡岈岐巾嵓嵼崏已嵙嶶嶟帶幆䃩幓徃弁䀳庌弮帼廼弊循忟䄉忇恗恐怽恃惎恂悯惿悵慼慑愾慰憹憘懺懖扒糧戾扒报抐抢抏捽挌捣捛掺掝揧拷窺摊摣摓撲撘撖擲擝敭敎斻攐斸旔斾筊晠易昹昙晤曁暩曍杤秸朣杉査柎枨枍栨栃栲栉瘣棶梞梵癝椻楒矦椌榷槇榠椕橺樒樼璫櫦檎檼檙歪權橘櫘畤毅毥殉汢汒污氋気汿泞泖泛洺洔浸洴浥涕涂涆湳渑渲烎滭滅滬溟潿燰漫潋澦濷澫澁灭灕灠瀽滝烲炜炭渽焢焘焿濗熵燜潬熆爱牁爺犏狤犌犦犋獹猈獶獕玲玄玷玊瓭琀瑫琬琈瓲瓜瓺球畡甗甎甔痺痛痲疽瞱瘏瘶瘘栩盟盪皁睡槠眨睯瞤瞃矯矁硑硪磟破硜磭硚磹碚祸祅礦祔秡砓禸秐穹竎稣程窧窊窽窀旈筏筥笒筣篌箦節箋籶籘簳籛糹戜粨糗簇揬絯絓緱緙挙総繭绞繬繚纪绂纠纒缪缅缯缋罶翏羧翿羝胮耜耹耕胭育胝肸臗腺脔腒臒鼔膟臎艏苸舅舭芩苼芆芯茥荴茌茰菀菴菾菔菝萼萖葺萷蓿蓂蒯萟蕺蔓蔾蔘魗藚藴藍虡颈蘤蘁蚨蛑頧蛅蝦蟗蜬蜆螠蟫蟟螴蟐蠻街雺蠖裿袖袽阧襽褒褳覄觡觉觭覘詪詃詩訞詧誆诔訅謣譚謠謎謗设译讽讖谺豋跹谞貶賁鈿賓赣资趱贆趮鍲跬趈軫蹊蹨踊軧軕軤躳轭轓輡輫輟辽辔迪迏逯逘酆軉郻邔郢郇鄨鄙酅酎醭醁釫醩責鉘鉧鉔銿銄銷豃鍨錀鍽鎾鍝鏔贚鎮鏙鑕铚鐢鑙钴铞訷钒锰镡閬锃闫開閩譌陸阇阤隑雪雄離隕靡靶霒靽霘面韔鞾韘顕飂頻頓颳飆颰颙餯饾餢餞駪駞馨駈驱髆驥驝骺骛髸髀骒薽魓鬴魛鯬蕘鯸鮕鳢鱛鰳鱓鳦鳐鲹鳥鴮鴍鵡鵋鷉茌鶸鷇鸵鸟鹤鸇鹻黏麧黿麼鿩齒鼼齚鿭鿙龾鿖ꁅꁛꀡꀓꃥꃑꃯꂍ뾨ꅜꅫꅘꆥꆈꇵꇖꈫꈔꉳꉒꊡꋍ발ꊰꊕꌼꍙꎮꌗꏿꎗꎢꎔꑽꐓꐱ뫔ꓠ\ua48fꓽ꓁ꔬꕆ믩ꔇꗠꖇꖮ묶Ꙫꘃ\ua634ꚁꚠꞎꙟ\ua6fdꚄꝺꝔꜱꝘꟻꟗꞸ\ua7cf꠳ꡟ뛲ꠞ꣧ꢎꢮ뙉ꥻꤊꥺꥈ꧵ꠇꦬ꧄드ꨂꨬꨁꨏꪾꪌꫩ\uaacdꬶ\uab19ꭩꭂꮡꮕꮿꮛ걻갑갽갎고곊곬겉귾굇괯굇귲귄궭귃깡낄기깿까꺱꺜꺳꺕놮꽛꽷깧녀꿝꿳꾐꺠끞뀨끎놜냅금낇넩녛꾶녆뇮뇍꼄놌눋눀눟뉳뉝닑걤닺늚데귾덶댆굅뎓뎱뎙둿됏됬뒙듢듌듪뒝땩땎땦딆ꬡ뗓뗢뗓똠뙩뛞뙽똟\ua83e뛊뛹뛋뜷띔ꧤ뜚럴랒랼꥓롡롆롭렄Ꙙ룄룩뢊맳륈뤢륄맷맃릨맀릉뫾먝뭍몚몺뫁몹몙뭾묕문묒믿뮻믚뮼ꋾ밍밇밢ꉌ볧볂볇봦봈뵤뱳뷫ꍢ붭뷿붍ꃬ븜븰븓ꁞ뻖뻭뻖뽻뽜ꇾ뼜뾱뿛뾧뾇쀭쁄\udeea쁊샊생삪삄셠셖셯셂쇒셓쇖쇾솵\udca5쉘쉺숨십싎슸싙쌴\udded썲쌵숱쎃쏮싯쑢쐋쐞쐛\uda51쓊쓦쓍씱씃쑓씈\udb43엲얗엱엜왈\ud8eb왹왉욺욂웵욺읲읟\ud9ee윓잯잆쟼쟌줚졃횊젅좮좊죥좼짩쥌쥡줃줐짰증짴짎쨺쬨쨱풴쫻쪜쫞쫓쬲쬜쭰쬬핣쯌쯬쮃쳪챇찯챝첦쳴첱첚촢쵭춣촰쵞췖췝춶춟층츘츺킓컶캔쿃퀧콸켐칞켇텎쿁쿫쾙컸퀈퀬퀏칂탊탣탊텢쾃텖텾턉퇮퇚톴톞툸퉵툺툔틷틘틲튶퍿퍄팻퍍폞폄펹펌퐤퐇퐀퐗퓭퓆풰풄핮픳픞픟픎헴헖햠험홄홥혟화훔훝횵훜휯흻휿힘ퟥ힊힝힚\ud9b7\ud806\ud807\ud885\ud8f7\ud882\ud886\ud889오\ud977\ud911\ud97c\ud90b\ud9ff\ud9cd\ud9f8\ud9bf쒵\uda5c\uda74\uda3f\udaeb\uda9d\udaf0\udabd얡\udb43\udb6c\udb09\udbeb\udbd0\udbe4\udbc7\udc6e싼\udc34\udc43\udcf3\udcd4\udc20\udcf3\udcde\udd70쎟\udd35\udd12\uddb9\uddce쌶\uddd6\ude77\udec0\ude3d\ude15\udeb1\udec4\udeae\ude87\udf2d\udf4f쇮\udf1a\udfa9\udf9b\udfe9\udfc8\ue02b\ue00d\ue049\ue068\ue0ca\ue0e8\ue07e\ue09d\ue0f7\ue13c\ue11b\ue177\ue159\ue1d6\ue016\ue1bf\ue1d5\ue261\ue243\ue272\ue207\ue270\ue2c1\ue2a9\ue2c1\ue32c\ue37f\ue304\ue33a\ue3c5\ue38b\ue3e6\ue387\ue46b\ue450\ue431\ue441\ue4f2\ue53e\ue4d7\ue4fd\ue488\ue573ﯵ\ue530\ue558\ue5e1\ue556\ue5bb\ue593\ue619\ue612\ue671\ue65d\ue6af\ue6fd\uf820\ue68d\ue72b\ue746咽\ue701\ue7a7\ue7c5\ue724\ue787\ue823\ue851\ue82a\ue809\ue813\ue8f2\ue89d\ue8aa\uf610\ue97b\ue919\ue93b\ue91f\uf75f\ue9db\ue9bc\ue9d3\uea3a\uea7d\uea39\uea85\ueae0\uea8d\ueaa4\uea84\uebea\ueb47\ueb64\ueb47\uebca\uebc4\uebbe\ueb86\uec2e\uec01\uec11\uec2a\uf2dd\uecbd\uecdf\uf27c\uec8f\ued39\ued53\uedbd\ued18\uedfd\ued94\uedb8\ued9a\ueefc\uee19\uee45\uee4e\ueead\uee81\ueeeb\ueea2\uef60\uf1ef\uef32\uef46\uf16c\uefca\uefa4\uefc2\uf062\ueec7\uf05e\uf07e\uf01e\uee3f\uf0d2\uf0fa\uf08d\uf16a\uf156\uf138\uf112\uf19e\uf193\uf1f2\uf1dc\uf230\uf27c\ueca3\uf20c\uf2ac\uf2c7\uec1d\uf280\uf328\uf345\uf329\uf316\uf3f7\uf383\uf2d3\ued08\uf46e\uf478\uf41e\uf424\uf496\uf4f5\uf49a\uf4ad\uf48a\uf5fd\uf558\uf575\uf519\uf5f2\uf5c2\uf5db\uf5d0\uf62f\uf603\uf66d\uf623\uf6fb\uf6de\uf6a0\uf687\uf769\uf71c\uf765\uf709\uf7e2\uf7d2\uf7e1\uf78c\ue95e\uf870\uf855\uf87c\uf81c\uf8f3\ue61a\uf8b5\uf8d7丹便若串沈撚念\ue706舘嗀ﭝ慠\ufae4贈\ufae8𢡊ﭲﭗ\ue5afףּ望\ue572ﯠ﮼ﮖ\ue2ccﱒﰼﱚﳵ\ue219ﲹﲞﴼﴘﵳﴆ\ue340\ufdd3\ufdefﳿ\ue0d4︌︨︂\ue028ﻑﻫﻆｵｌﾢ６ﾡￎ\ue16a\ufffeﾎ}Nz\u0012ðÞö\u0096żᾌĦ",
         9795
      )
   };

   private IO__() {
   }

   static void II(IOo_ var0) {
      IO0o var1 = new IO0o(50).II(I_.length);

      for (int var2 = 0; var2 < I_.length; var2++) {
         var1.III(I_[var2]).II(Il1_[var2]).II(Il1O[var2]);
      }

      var0.II(var1);
   }
}
