package main;

public final class IOIl extends IO11 {
   public static void I___() {
      IlOI = Iloo("癄梄瘪癃盡癒盠皲皋槌睒睻癫楌矑矷瞛磴硍硳砑磹晗磯碅祥种礨祊秢秀礳禈穢稛", 30214);
      IlOl = Iloo("癒棾瘭癃盕盉皩皬盞眵睴瞻眔矱瞘瞣瞟硻硜硳砰磸磜碣磇礭砽枈祊秡来禤秆穱穑稺撥竵窀竔搧", 30214);
      IlO1 = Iloo("癍癍瘭癃瞓栀皴盿皊槌睕睻癫矸瞘瞣瞞磵硚砻硒磥磘普碁礡礌礣禉称禈磖杙穫稄稔稊竨竓窟競窵篼筕笲筙篬篞箸箝簴籱簻簝糼粆糮緼描紋紤綋緦緀緦綆悡繓繢縕绵绦恹纩络罰懃", 30214);
      IlO_ = Iloo("癒癍皤瘍盪皁皴皷桟睲", 30214);
      IlOO = Iloo("癞盖瘥癃盶癁皩盿皕睵睓槸眔", 30214);
      IlO0 = Iloo("癎监瘩癃盬盀皹盿皜榼睒睻癫睺瞘瞹楗硥研砽砚磸晱確磎祣祋枆礉禧禈禉禁童穝穣稏章竉窟窶稞筥笛笴旘篨算箢箜披籃籲簟糸籆糯", 30214);
      IlOo = Iloo("癍癍瘭癃盠癀皮盿皊睵矜眵眒瞹矛眣瞘硲研砠曏碱磞碧晃祣礌礧柋秠禈福朵穫穃穣稬竦摭竜竾窖筴篏笴笞箸篇箾敖籽簓簜簖扝糌糢糍絮掊紤絉緫絔緦綈繱惲縬繁维绶态纭络罯懟缺罘翼罛翵羓黾聛聮", 30214);
      Il0 = Iloo("癕棈癤瘇桧盏皧", 30214);
      Il0I = Iloo("癋棺癤瘈盪癒皡", 30214);
      Il0l = Iloo("癕棰癤瘐眲盔盠皫桙睰", 30214);
      Il01 = Iloo("癄梄瘪癃盩盉瘴皱皙眽瘭榼", 30214);
      Il0_ = Iloo("癅癍梭瘀皢盏矃皱皙眽睈槺眗瞹矜椼瞘硲研祂暱碱磒晬碁礭祘礹禆", 30214);
      Il1O = Iloo("癈梄瘴癃盌盆栍皼", 30214);
      I1Ol = Iloo("癄梄瘪癃盡癒盠皼皖榲睟睻眗矬楩瞹矖硻硜曤砆碱磆晢碚礭祜礣柃秤禈禩礆穼稄稨稊穵竎竘竾竂", 30214);
      Ill_ = Iloo("癲梂瘪瘄", 30214);
      Il0O = Iloo("癅癊瘪癃盱桰盠皲皟睤眜眶槕矷", 30214);
      I_O1 = Iloo("癋癌瘪瘊皢盆皡皲皛", 30214);
      I_Ol = Iloo("癒癍皰瘍盥皁皢瘾皑", 30214);
      IIo0 = Iloo("癒棔癤睲桛盏皧盿皖槎睕睻眉矰矖瞿", 30214);
      Ill0 = Iloo("癅癍梭瘀皢盏矃皱皙眽睝眮眎矶", 30214);
      Il00 = Iloo(
         "癄梄瘪癃盡癒盠皼皖榲睟睻眗矬楩瞹矖硾暋砧硒磹晓碿磎祻砅礥礂禩秞禮朣穫稄稵撹竨窀箮搙竝筨旖筺笚敿篖篶箘糸籝簺籑系糇簺粃絫純絪紫挩緉緦綖悹縃縯惄维线羯怚络罯懗罹缎罷羖羡羛胳聜聱耒鹖肎肹肞腪腄脮腈臥齭臥胵鳄舂舵鲍艟莏苜芲芜茺荔鷯茔莺莕莠莜蓲葟葰萍驗蒍蒿騂蕩蔉蔥鯆藨藍藤薀飥虀虠蝎颹蚽蛈頶蛚蝪馅蝷蜕蟽蟁螪餱衿蠐蠻蠆衭裂袣裊襽襁鞆褋覥觊裀覌試言詜钹訜誼諙鑻誗",
         30214
      );
      lIIo = Iloo("癎棆瘴癃盶盉栃盿皈瘴睒眳睚矯矑椒瞘", 30214);
      lII0 = Iloo("癎棆瘴癃盶盉栃", 30214);
      lII_ = Iloo("癐癐瘭癃目癓皮皸盞睳睔槶眊瞹皩椰矖硡硜碧砜磶碐碻碇祣", 30214);
      Il_l = Iloo("癅癍知瘊皢盕皩桠皎", 30214);
      IloI = Iloo("癐棤癤瘍盪癁", 30214);
      Ilo = Iloo("癒癗棥瘍盥皁皴皷瘟睴", 30214);
      Il_1 = Iloo("癒梀瘪癃盡癕皮皸", 30214);
      Il__ = Iloo("癄梆瘫癃直桦", 30214);
      Il0o = Iloo("眖癌癤瘗盪盄皯", 30214);
      Ilol = Iloo("眖棢癤瘗桯", 30214);
      Ilo1 = Iloo("癋盄瘽癃盡盉栧盿皊榲睈睻眒矶椏瞴矖硸暑砧硒磢硃碡碉", 30214);
      IlIO = Iloo("癅梀瘱癃盪癍皮皷盞睩睔槾眊", 30214);
      Il1l = Iloo("癅梀瘱癃盪癍皮皷盞睾睝眴", 30214);
      lI = Iloo("癒梆瘭癃盦桎盠皳皗槚睉", 30214);
      lII = Iloo("癞盖瘥癃盦桎盠皳皗槚睉", 30214);
      lIII = Iloo("癄梄瘪癃盡栆皮盿皆矮睝睻眎矫矗瞹瞑砵础砡秂晌磞碨磎祥柏礻祊秪祛秧禊擒積穣稖搢竉窟窺搒笼筗笳斾篭箙篶箾籼籚籲簉籣糎糮粕絣絅紭絅綨緅捧綋縤繓縪惂绩线绊恾纕缻罖懸缑羷翂羺缔聽耒耳麩肯膿鸎背腨臙腩脜臯齥臥膇艫莃舨艎", 30214);
      Iooo = Iloo("癎棂瘽", 30214);
      Ioo0 = Iloo("癐癐瘭癃目癓皮皸盞睩榟眲睚矽楗矷瞚硼曳砦硒禀晳磯碍祥碍礢", 30214);
      Il11 = Iloo("盜癈癤瘁監皁皬皾盞睥矐睻眘睠矙矹矘砻", 30214);
      Il10 = Iloo("癅癍皾瘀皢盌栫皱皙眽睟眴眔瞹矖瞿真", 30214);
      Il1_ = Iloo("癅癍皾瘀皢盂皯皱盞睰睝眢睚矴椗瞹矖硹暓砽硒磢磑確", 30214);
      IooO = Iloo("癄梄瘪癃盡癒盠矎桁睳眜眯益瘸矖瞰矖硹硕砺硒磿磗碮碗礭祎禩礓禩秏禮朻稥穒撘程窡竇竖稿竝笭笛笴笞敕篔篶箞籼糇簼簖粰粐", 30214);
      Ioo_ = Iloo("癒眦瘪瘄皢盕树皼", 30214);
      II0_ = Iloo("癄盅瘪癃盲盉瘭皲盞榾睓", 30214);
      Ilo_ = Iloo("癄盅瘪癃盲盉瘭皲盞榾睓", 30214);
      IlI0 = Iloo("癄盅瘪癃盲盉瘭皲盞榾睓", 30214);
      IooI = Iloo("癋盆癤瘁校盎盠皩根", 30214);
      Iool = Iloo("癈癍棩瘓皢盌瘣盿皜榾睓睻県楞", 30214);
      Ioo1 = Iloo("癋盆癤瘁校盎盠皩根眽睌眳槙矰瞘瞴眅砵礥暊硒磵硐碦磎祡秌祫祜禩秛朖秈", 30214);
      Ioo = Iloo("癐癐瘭癃目癓皮皸盞睳睔槶眊瞹矋椆矖礄硝暔砜碱磄碧碁枬祅祫礂秦期禤秆笔擯稢穂竢竈摶竾窘筱筚笳笕箴範箷简簴索粡籑糾糇扣粝紬絆揧紝綨緌綮捌繱縃罓悢纠绫怟纲络罯翚缰罘翼翞羺慗聽耒耼麫胦", 30214);
      Io0o = Iloo("癄梄瘪癃盱栜盠皲桛睩眜眯瞚矰瞘瞼瞞硺暗砽硒禀磑碡碉礭祏礣磋秠禈禱礆稥穏稫窖端竇窟窪窕旟笛笱笑筬篞篶箅籼拖簱籑綁紟戭粎紬絅揵紜綨粶挓綌縤繗红縈纠维绖纲恟罵缚缲缐罶翕翹翔聱麓耿聐胬聝胭臽鿘腄脮腈腺膆膮膌苷艌舦艀艀", 30214);
      IloO = Iloo("眖眦瘪瘄皢益瘭盿矯槞眜眹槙矶瞘瞡椱砵础碳砛碱磛碧碁枮祂", 30214);
      Io00 = Iloo("癄梄瘪癃盲盉档皶盞睵睓瞻眔瞹矌瞿眖硻硜硳砜磹磙昈碃礭祚枮祊秽祄禪秆穫穃撎稁窡窖窟窭窜筳笛笷斢篱算箵笆簴籇簺抲粰糁扯粝紬絟紣推緦", 30214);
      Io0O = Iloo("療癌梁瘍皢瞰瘠皱盞睫矜睻眴椸矈矷瞸硲曹砰", 30214);
      Io0_ = Iloo("癅癍矴瘂皢盂瘳盿皈榰睈睻眊矱椑瞺矖硧硕砼硒磳硑碡", 30214);
      Io01 = Iloo("癍盌瘫癃目癋皮盿矯槞眜眸槗矩瞘瞹瞞暸础硳砆磹硚碢", 30214);
      Io0l = Iloo("癍盌瘫癃盺盔树皱皙眽瘭榘睚矺椕瞧矖硻硜曾砆碱磄碧砄祠", 30214);
      Io0I = Iloo("癒癗瘥瘍盥", 30214);
      Io0 = Iloo("癓癕癤瘷盭监", 30214);
      IoO = Iloo("癄盄瘪癃盠栐皮皸直睫矜眵眝", 30214);
      IoOI = Iloo("癄盄瘪癃盠栐皮皸直睳睛榖眙", 30214);
      IoOl = Iloo("癄盄瘪癃盠栐皮皸盞睫矜眵眝", 30214);
      IoO1 = Iloo("癄盄瘪癃盠栐皮皸盞睳睛榖眙", 30214);
      IoO_ = Iloo("癎棂瘽癩盩癌盠皸栓睴", 30214);
      IoOO = Iloo("癈癍棩瘍皢盕皩栞皐", 30214);
      IoOo = Iloo("眖盆癤瘁癣盏", 30214);
      IoO0 = Iloo("眖癄瘪瘄皢盃瘡皱", 30214);
      Io_o = Iloo("癍盈癤瘄桯盈", 30214);
      Io__ = Iloo("盄癈癤瘗盪盀皮皷", 30214);
      Io_O = Iloo("盄癈癤瘗盪盀皮皷", 30214);
      IIOO = Iloo("癎梄瘪瘄", 30214);
      I___ = Iloo("癈眦瘪瘄皢瞰栙皱皙", 30214);
      Ilo0 = Iloo("眖癄瘪瘄皢瞰矃皱皙眽睗瞦", 30214);
      Iloo = Iloo("眖盆癤瘄桯盈盠皫皗睳眜眵眒椶矖矻矖硭硝砽硒磲磘昒磎祹祅礥祊秧秀杨禈稥穜窢稁窡竎竗摳窓笲", 30214);
      I1 = Iloo("癍癍皰瘍盥皁皴皷栽眽睛榄眓瞹矌瞾瞘砵硚砻曝磿碞磯碶祤祂祫礁秠杫禪秆穱穖稢穂竵竉摾窰竝筪篛筺笍篰敚篶箞籼括簻籑綁扶粠粊紬絇揫紀綨緀綧綈繡縍", 30214);
      I1I = Iloo("癁棈瘭癃盶盈皮盿皐睵榓眵睚短矐眷瞘硽研砰碆磿磗", 30214);
      Il_0 = Iloo("癍癍皰瘍盥皁皴皷栽眽睛榶眓瞹矌瞾瞘砵硚砻曝磿", 30214);
      I1II = Iloo("癅癍皾瘀皢盌栫皱皙眽睞槺眔瞹皩眴矖硲曫砺硒磥磙碡磎祣祄柤礄禩秌朶秆笔穋窢稌窡竔竗稾窓筴笛笹箍篶篐篸", 30214);
      I1Il = Iloo("癒癌瘪癃盬盉桯皱盞睺槑眲睚矲矐眣瞘硲研砧砚硱磞碧磎祮秘礥礍禧", 30214);
      I1I1 = Iloo("癋梈瘰癃盩盉桩皪盞睭睔槸眓瞹矛眤矖礄曭硳砖硱磙磯碂秭礌祽祊秢祕秧禒擴稊", 30214);
      I1I_ = Iloo("癋梈瘰癃盩盉桩皪盞睿榟眴睚矯楿矷瞕硽曽硳砑磹磟磯碀祥极礻祊秺杹秩", 30214);
      I1IO = Iloo("癈癍棩瘓皢盌桭皫盞睶睔槲眏瞹矚楴瞙砵硂暔", 30214);
      I1I0 = Iloo("眖棰瘭癃盶癁皩盿皕睵睓槸眔", 30214);
      IlO = Iloo("癄梄瘪癃盡盉睰皾盞睳睔槶眊瞹矝瞺瞗硼硘硳砚磾昇碬磎祾柽祫礎秠禈磖朿穫穃穭", 30214);
      I1Io = Iloo("癄梄瘪癃盡盉睰皾盞睳睔槶眊瞹矕楺瞂砵硟砻曛磤", 30214);
      I1l = Iloo("癒盏瘪癃盶癁皩盿皕睵睓槸眔瞹矈瞿楕硼研砽砚磸晱確磎祥碍礥祊禼禈禬礛稥穐撲", 30214);
      I1lI = Iloo("癕棴癤瘇盫皁矑栆皐睺眜眰眒睭矖瞰矖硽曗砣硒磽晷磡磎祕祅礥祊秧秀杪禖稥穐稫稇竮窀竒摵窈笼笋筣筈箪箄篢節簢簄籪籑糸糀批粎紬紓絾結綹綟緱緓縱縗繱繓", 30214);
      I1ll = Iloo("癃癈瘥瘊目皁皫皷瘊睳睛睻眒楺矈矷瞚曒砚硳砪磸磞磯碀祥极礻祊秽秀禢禉稥穉擨稗窡竔竚窰窞筩筚笸笘篶篷箯箔籼籜簽籟糳糀粣糍絤組揽紊綨緓綣綋繧繖縣縃绡绱绾纺纑罺罓缵罖翴翙羸", 30214);
      I1l1 = Iloo("眖眦瘪瘄皢益瘽盕皊矽睕睻眑矱矗楴瞘砟硙暈砛", 30214);
      I1l_ = Iloo("癅癍梉瘍皈盌瘡皦盞睾睔榼", 30214);
      I1lO = Iloo("癗癐皮瘍皢盬目皴皖榺睉", 30214);
      I1l0 = Iloo("癋梈瘰癃盩盉桩皪", 30214);
      String[] var10000 = new String[]{Iloo("癅癍矴瘂皢盂瘳盿皊矽睕睻眑矱矗楴瞘砵硌砺砜", 30214), Iloo("癥癍梉瘍皢盌皥皱皋眽瘭癘眔矾瞘瞼看砻", 30214)};
      I1lo = Iloo("癒癌瘪癃盬盉桯皱", 30214);
      IIOO = new String[]{Iloo("癒癌瘪", 30214), Iloo("癨癍棫瘍", 30214)};
      I11 = Iloo("癍癍皰瘍盥皁皣瘬盞睩睕眵睚矷矐楸瞘", 30214);
      I11I = Iloo("癄梄瘪癃盡癒盠皲皋槌睒睻眒矬楏矷瞕硽曝砰硒磿禳碡碉礭祎柨礅禩秞最秆穱竄稪穂竪竈竐摽窓笼筐笲箍篶篐篶篊", 30214);
      I11l = Iloo("癍癌梇瘎皢盕皲皾盞睾睔瞶眔矱瞘瞯眗硶研祂暱碱磜晪碗礭祀柪礃禩碹硷朅穦稄稷窂竨窀竔窶窒斿筕筺笗攧篂篶箆籵籆籲簟籰糖糮粜絹緁紤絉緥挊網緅繯繋惫縔纊", 30214);
      I111 = Iloo("癕棴癤瘇盫皁矑栆皐睺", 30214);
      I11_ = Iloo("眖森瘥癃盡盉栉盿皓睼睕眷", 30214);
      I11O = Iloo("癒癮", 30214);
      I110 = Iloo("癋癮", 30214);
      I11o = Iloo("眖棦癤瘏栧盘盠皳桟睴眜眶槗短瞘瞼瞞暼硁硿硒磩磙碡磎祻祙礢祊秥祚禩禁稥穒窣稍窡竗竚窼窎筵筏笿筙篰篃箢箅簮簜籽簟糷糀粭粟絣絅紭紆緦緋綯綋繡縍縡縎续纰结纼纈罰罒缸缍", 30214);
      Il1 = Iloo("癈療梉瘀皢盓栓皱皙", 30214);
      I1_ = Iloo("癈癍皦瘍皢盗桭皫", 30214);
      I1_I = Iloo("癒盅瘭癃盩盉皯桼皐", 30214);
      Il1I = Iloo("癋盄瘽癃盡盉栧", 30214);
      I1_l = Iloo("癄梄瘪癃盡盉睰皾盞睳睔槶眊瞹矌眽瞘砵硚砻碐磿碐碹晃祹", 30214);
      I1_1 = Iloo("癒盏瘪癃盬盉瘢皱盞睫榑眯睚矨矍眶矖硻硓曼砜", 30214);
      I1__ = Iloo("癒盏瘪癃盬盉瘢皱盞睫榑眯睚矲矐眣瞘硲研祂秂晲磓磯碟祸种祫祛禼禈禬礋稥穐撲", 30214);
      I1_O = Iloo("癈癍皦瘍皢盗桭皫盞睾榛眵睚皈業瞾矖硡磞砽", 30214);
      I1_0 = Iloo("癒盏瘪癃盬盉瘢皱盞睫榑眯", 30214);
      I1_o = Iloo("眖眦瘪瘄皢盏皨桲皎", 30214);
      I1O = Iloo("眖瘋瘊瘋栯监", 30214);
      I1OI = Iloo("眖眦瘪瘄皢益瘽", 30214);
      lIl = Iloo("療森瘧瘋皢皫皣皷皋睤槿眵睚短楣瞾", 30214);
      I_l = Iloo("癒癗棧癃盶盉瘹", 30214);
      I1O1 = Iloo("癞癌瘪癃盡盉栝", 30214);
      I1O_ = Iloo("眖癄瘪瘄皢益桿皫盞睳槭眲", 30214);
      Io_0 = Iloo("癍癍皰瘍盥皁皣瘬盞睶榇睻眎矱睁", 30214);
      I1OO = Iloo("眖癄瘪瘄皢盕档皶盞", 30214);
      I1O0 = Iloo("癅盖癤瘏桕盈盠皧桝睤眜眩眛瞵瞘瞯瞟硻研砥砇磸碐碣砜祣祋祫礁秡杷禮秆笔擽稭稅窡竌搞窷竝筻筚笷笜箶", 30214);
      I1Oo = Iloo("癅盖癤瘏桕盈盠皧桝睤眜眩眛瞷", 30214);
      I10 = Iloo("眖棰瘭癃盩盉皵盿皈槬睟", 30214);
      I10I = Iloo("癅癍梉瘍皢益皨皪盞睫槍眸", 30214);
      I10l = Iloo("癑癀瘦瘐盫盕皥盕皚睴槹眵睚皈睘瞹", 30214);
      I101 = Iloo("癋盄瘽癃盡盉栧", 30214);
      var10000 = new String[]{Iloo("癎盅瘪瘋皢盕皲皾皐睺", 30214), Iloo("癍棜癤瘍瞁盏皧", 30214), Iloo("癒癌梅瘎皢盏矃皱皙", 30214), Iloo("癒癍皰瘍盥皁皴皶皐", 30214), Iloo("癒癗瘥瘍盥皁皢栔", 30214)};
      IIO0 = new String[]{"", Iloo("療盇瘪癃盶桸皣盥盞", 30214), Iloo("癒盖瘧癙皢", 30214)};
      IIOo = new String[]{Iloo("癒癗皥瘊皢瞰桥皫", 30214), Iloo("癈癄瘩棜盡", 30214), Iloo("癞癄瘽瘇監", 30214)};
      if (IO10.l_lI == 7) {
         IIOo = new String[]{Iloo("癔棶瘪瘄皢瞰桥皫", 30214), Iloo("癔棶瘪瘄皢盙皡皱皖", 30214), Iloo("癔棶瘪瘄皢瞰栏", 30214)};
      }

      II0 = new String[]{
         Iloo("癒癍皥瘀盪皁矑桺皋", 30214),
         Iloo("癊癐瘽梤盬皁皴桲皎", 30214),
         Iloo("癅棎瘱癃盱癀皴", 30214),
         Iloo("癍梚瘰癃盠栀皮", 30214),
         Iloo("癋棸瘭癃直癁皯盿皜睼睒眼", 30214),
         Iloo("癖癍梡瘀皢盉栓皶", 30214),
         Iloo("癞癀瘩癃盶盉瘴皱皙眽睈眲眔", 30214),
         Iloo("癅癍瘥瘗皢盓皩瘵皐睺", 30214),
         Iloo("癋棸瘭癃直癁皯盿皊槄睟", 30214),
         Iloo("癅癍棳瘍皢盙皩皱盞睫矜眴睚短楡瞴", 30214)
      };
      IIl_ = new String[][]{
         {Iloo("癈癍瘭梤盯", 30214), Iloo("癐检", 30214)},
         {Iloo("癎盅瘪瘋", 30214), Iloo("癒癗瘥瘍盥", 30214)},
         {Iloo("癍棜", 30214), Iloo("癈眦瘪瘄", 30214)},
         {Iloo("癅癍梭瘀", 30214), Iloo("癈眦瘪瘄", 30214)}
      };
      IIlO = new String[][]{
         {Iloo("癈癍瘭梤盯", 30214), Iloo("癐检", 30214)},
         {Iloo("癎盅瘪瘋", 30214), Iloo("癒癗瘥瘍盥", 30214)},
         {Iloo("癍棜", 30214), Iloo("癈眦瘪瘄", 30214)},
         {Iloo("癄癄瘪瘄", 30214), Iloo("癎棼瘭", 30214)},
         {Iloo("癅癍梭瘀", 30214), Iloo("癈眦瘪瘄", 30214)}
      };
      IIl0 = new String[][]{{Iloo("眖棢", 30214), Iloo("癒棈", 30214)}, {Iloo("癒癗棥瘍盥", 30214), Iloo("癒癍皥瘊", 30214)}, {Iloo("癎盅瘪瘋", 30214), Iloo("癒癗瘥瘍盥", 30214)}};
      IIlo = new String[][]{{Iloo("眖棢", 30214), Iloo("癒棈", 30214)}, {Iloo("癒癗棥瘍盥", 30214), Iloo("癒癍皥瘊", 30214)}};
      II0I = new String[]{
         Iloo("癐盅瘫癩盲盉瘭皲盞睌", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞睊", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞睘", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞睏", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞睉", 30214),
         "",
         "",
         "",
         "",
         ""
      };
      II0l = new String[]{
         Iloo("癐盅瘫癩盲盉瘭皲盞眪", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞眥", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞眤", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞眬", 30214),
         Iloo("癐盅瘫癩盲盉瘭皲盞眮", 30214),
         "",
         "",
         "",
         "",
         ""
      };
      I10_ = Iloo("癅癍瘭皉盷皁矑瘾皐睵眜眳眓楞矖矷瞂暴硝硳砑晶磑磯碌枬祂祫礉秡砘禦秆穫竆稭稅窡竃搚窮竝稍既", 30214);
      I10O = Iloo("眖盆癤瘋栽盕盠矎桓睨眜眯眒椾矖矹矖硖暙砦硒磹硓碶磎祻柭祫礞秡秝秧禎穪撅稠稊窡竔竗稴窐", 30214);
      I100 = Iloo("癄梄瘪癃瞓盀皮皸盞槂眜眰眒矬瞘瞡椇硶研砽碒磨", 30214);
      II01 = new String[]{
         Iloo("癎盆瘽癃瞓盈盠皫瘒睰眜", 30214),
         Iloo("瘦棺癤", 30214),
         Iloo("瘦眴梇癃盬盉桭皱盞睳睔眲榽矴瞘瞡椓砻", 30214),
         Iloo("癄梄瘪癃瞓療盠皷皑矽睒睻眎矱睘瞹瞞砵硜曬砆碱磞碧碇柊祁祫礜杬禈禷禎穬竎稭穂竣搃竑竾窓篼筂筶筙篮篂箿篕籸糁簼簖粰糌粦戰紬絈索紆綨粶捹綋縤繈縪縈纠续统绽續罳罓羳编羷翔慶羚耳聆耸黏胿肎肹肄腮腅腧", 30214)
      };
      II0_ = new String[]{Iloo("癍癌梃瘗皢盒栩皼", 30214), Iloo("癅癍梙", 30214), Iloo("癐棤癤瘍盪癁", 30214), Iloo("癎棶瘭癃盱盈皮皷直睳睛眺眃瞓瞐矦矖硻硓暞砑碸", 30214)};
      var10000 = new String[]{Iloo("癄梆瘪癃瞓桲", 30214), Iloo("癈癍瘭梤盯皁皶栺", 30214), Iloo("癁癌瘥癃盶桸皣", 30214)};
      II0O = new String[]{
         Iloo("眖梈瘱癃盶盉桧皱盞睹矅眵眝瞹皩椔矖硡礷砽砕碱磻碆磎祻秌祫礢秙禈禩禁穤穝穣税搬竐窟窪搔筿", 30214),
         Iloo("癄梄瘪癃盡盉栉盿皓睼睒眼睚短矐瞲瞙砵硚破秂晌磙磯秿碽柏礨祊禸禘秧禎撤穐穣筳搬竕窑竾窳斣筎筺笔篭敦箸篕籹籒簼簖粰糁粦粄揍絞絪紁簩緉緪緅繬绀縻繁绸绶绐绽纈懰缚缻懙翹羖羷缜耳聆耣耟胡胉胭肮腪腄脮", 30214),
         Iloo("癒梀瘰癃盡栂盠皼瘟睾眜眨瞛矺矐矷瞝曬研砽祱磿磗磯秿柌祙祫礉祺禈禳禎擆稄稫撯竢窀竒窷搸筲笛笪笑筵算箢敔籽簓簃簄糩粏粂簎絣紋紁紈緥緂緪緅繯繋縫繁绢怾绐绽纟翨缚繈憟羷级羼愷聾耒耥耙鹎胃胭肂耈腄脮", 30214),
         Iloo("癄梄瘪癃盩盉瘴皱皙眽睈眳榹瞹矚瞶瞏砹研砷碋磿磗磯碅柴礌礥硩秧秏秫秆穫撛稶穂竩搟立竾窶筕", 30214),
         Iloo("癒梀瘪癃盡癕皮皸盞睬睉瞺眓瞹矎楺瞂砵硗碪砜磶碐碭晏祣礌礩禂禩秜禵禉穫穃穣稠章竎竘竾窎斡笛笷笘篶篐篶箙抵籚籲簟糸糆戏粘紬簺紣措緥綇網綌情繎繢縏羃绱给绽纔纺罔罹繩罶翘羽翔聾黫耥聐胢聂肣肄", 30214),
         Iloo("癒梈瘴癃目盔皹栘皐眽睊榀眓瞹矚楶瞘砵硖碻硒磥昑碦磎祦祄社祊秿杙禤秆穱穌窮稁竩窀竗搽窍笼筈旧筙篵篖箸箒簴籟拳簘粰糁粦粄揍絞絪籸緡捤綫緅繰繊悃縌纠绱羽纳纛缻罒绸编羷级缴羚聻耒耠者聮胇胭肚龦腞", 30214),
         Iloo("癍癍瘭癃瞓眑栣皼盞睳矞眵眝瞹矛楲瞆砹研祂曟磤碐碻碆枪祂祫礙朴禈禷禎擠穇穣稊摒竉窟窰窕筵旺笯筙篐篧篶箃糴簓簙簸粰糇絯粃", 30214),
         Iloo("癐盅瘫癃盶盓瘲盿皝睵皝眲睚皈楹瞢矖礄暃砽硒磼晧碦磎祣祋禫礓禩碹朄秆穫穌擮稌窡箱笏搽窞笼筵笽斴篻算箻箜拑籝籲簁糸籂", 30214),
         Iloo("眖盜瘭癃盥癁盠皬桃眽睌眳榟矺瞘瞿椥硼研硢硂碡碕磯碦祝礀祫礡秀禆秧禥童稄稠稊竴竁窟窮窕旹筘筺笑敋篞篶範簤簃籷籑糛糦糠糍絏緋絪紛捙緓緦綕繬惆縡繁绨恌绗绽绍缫缊罼罘翟翦", 30214),
         Iloo("癅盇瘽癃瞓栌皵盿皊睵榛眵睚矲椇瞣矖硸曭砧硒磹昑碻磎祾祍社祊秤東禳秆穱穌撞程窡竇竖窿窓笰笛笹笑篷算箲笌簴籑拳簟粰綾粯粃絫紋紥紏緮緋綯綋繡", 30214),
         Iloo("癕癄瘱癃皱皁皮皸瘞睤眜眰眒睭矖瞰矖硡硜砲砟碱磗碦碏礭祘礹禘禩秋禯硇穬稈穣稀搠竎窟窭摀笼筙斑筙篿篞敵箘簴籀抻簒粰糂扯粃絤紋紮紆綨緋籶挸繭縃縮縔绹恘绐绽纈憶罊", 30214),
         Iloo("癄梄瘪癃盱栜盠皸皗榾睑睻眎矱楻矷瞚曤硗硳砙磹磙磯秿秬祂礣祊秸秝礦福稩稄稭稊笱竎竘竾窎斡笛笮空篶篐篶箙抵籚籲簅糸扬糮粁揽絈絪紂締緎緦綎繬绗縬縆纠美繟纳纔缻罔憶缙", 30214),
         Iloo("癍癍瘭癃盬癁皯盿皖榢睈睻眔矾極瞴矚砵硖曲砜碱磘砬碗礭砽柴礄禩秋禯朱稥穦窱穂竌摹竑窹", 30214)
      };
      I10o = Iloo("癕癄瘱癃盩盉皩盿皙睴睝睻眔矱椕瞧矖硣磔砼硒磽晫碿磎祥柡礨祆禩秜禯礊稥穇窰穂竵竈摼竾窓筴斖笴筙篶篟箿攲籹簓簤抔粰糛戥糍絤終掍紜綨緓綴籕惛繍縥", 30214);
      I1o = Iloo("癕棴癤瘐盧盓皩", 30214);
      I1oI = Iloo("癋盆癤瘗盪栚", 30214);
      I1ol = Iloo("癈梄瘴癃盶盉桻盿皨睴睒眺睖瞹矵瞸瞔硼砘硳砤磸磕碻碚票祀祧祊秎秉禳禃", 30214);
      I1o1 = Iloo("癈梄瘴癃盶盉桻", 30214);
      I1o_ = Iloo("癐癐瘭癃目癓皮皸盞睳睔槶眊瞹矋椆矖硦硑砡砛磰磜", 30214);
      I1oO = Iloo("癐癐瘭癃目癓皮皸盞睳睔槶眊瞹矕眴矖硶硛砷砗", 30214);
      I1o0 = Iloo("癒棬", 30214);
      I1oo = Iloo("癒癗", 30214);
      I_ = Iloo("癋癀瘪瘖", 30214);
      I_I = Iloo("眖盖瘪瘄", 30214);
      I_II = Iloo("癞盖瘥", 30214);
      I_Il = Iloo("癒癌棻瘓皢盕栥皼", 30214);
      I_I1 = Iloo("癕棈癤瘇桧盏皧", 30214);
      I_I_ = Iloo("癅盖", 30214);
      I_IO = Iloo("癍癍皰瘍盥", 30214);
      I_I0 = Iloo("癒癍瘫皂盶", 30214);
      I_Io = Iloo("癅癍瘥瘗", 30214);
      I_lI = Iloo("癉癮", 30214);
      I_ll = Iloo("癈癍梟", 30214);
      I_l1 = Iloo("眖棶瘪瘄皢癜", 30214);
      I_l_ = Iloo("癎棂瘽", 30214);
      I_lO = Iloo("癅癍梉瘍", 30214);
      I_l0 = Iloo("眖癌癤瘕癢盎", 30214);
      I_lo = Iloo("癋棺癤瘏盫盏皫", 30214);
      I_1 = Iloo("癒梄瘫癃盯桺皩", 30214);
      I_1I = Iloo("眖盖瘪瘄", 30214);
      I_1l = Iloo("癒癌皮瘖皢盅皩栘皊", 30214);
      I_11 = Iloo("癄梊瘰癃盶癁盠皫皖矧", 30214);
      I_1_ = Iloo("癰盅瘪瘄", 30214);
      I_1O = Iloo("癨療梉瘀", 30214);
      I_10 = Iloo("癮棶瘪瘄皢盏皧栒皝", 30214);
      I_1o = Iloo("眖癌梇瘎皢盉皩桠皋眽睟眳眓椦矖矷瞕曲硕硳砐昰磞磯碆祤柫礥祊秽有禮秆穩竄穣", 30214);
      I__ = Iloo("瘦癇棫瘗皢瞰桧皪盞睾槗眮睚矪睙瞣矖硷暕砽", 30214);
      I__I = Iloo("癍癍皰瘍盥皁矑核盞睖睵睻癫楚瞘瞤椛砵硐暶砜磶", 30214);
      I__l = Iloo("癄梄瘪癃盬盉桭皱盞瘌皌榸眙", 30214);
      I__1 = Iloo("癄梄瘪癃盪桬皣盿矯皭槟眸睚", 30214);
      I__O = Iloo("癄梄瘪癃盠癉", 30214);
      I__0 = Iloo("癍梞癤瘗盪癘", 30214);
      I__o = Iloo("癍癍皰瘍盥皁皣瘬盞睿榝眵睚矻睐", 30214);
      I_O = Iloo("癅癍瘥瘗皢盕皨桠盞睺睕榀眓", 30214);
      I_OI = Iloo("眖棰瘭癃盡桼", 30214);
      I_O_ = Iloo("癅梀瘱癃盪癍皮皷", 30214);
      I_OO = Iloo("癒眦瘪瘄皢瞰栓盿皖槐睝睻睒矺矐瞸矖硸磕砪硒磼昑碡碆礤", 30214);
      I_O0 = Iloo("癁癌棧瘎皢瞰栓盿皖槐睝睻睒矺矐瞸矖硸磕砪硒磨昏確磇", 30214);
      I_Oo = Iloo("癒癍皰瘍盥皁皢瘾皑眽睈榰睚矴睙瞮矖硶硜暴", 30214);
      I_01 = Iloo("癎盅瘫癃盳盔皡皱皙眽瘭槬眙瞹矚瞾椱硡", 30214);
      I_0_ = Iloo("癎盅瘫癃盳盔皡皱皙眽睏榲眙瞹矕楶瞘硽", 30214);
      I_0 = Iloo("癋盅瘪癃盪癍皮皷盞睱槧眵", 30214);
      I_0I = Iloo("癋盅瘪癃盪癍皮皷盞睳睔榔", 30214);
      I_0l = Iloo("癄梄瘪癃盡癒盠皲皋槌睒睻眎矱矗眶瞂砵硓砲砟磴碐秞昭礭祘礣礋称禈磖朳穬稄稠撃窡竍穟窰竝筴篗笴笑箸篜箾笁籺籔籲籎", 30214);
      I_0O = Iloo("癔瞕知瘍盥皁矑栌", 30214);
      II00 = new String[]{Iloo("癔瞕知瘍盥", 30214), Iloo("眖棶", 30214)};
      II0o = new String[]{Iloo("癎盅瘪瘋", 30214), Iloo("癒癗瘥瘍盥", 30214)};
      IIo = new String[]{Iloo("癍梚瘰", 30214), Iloo("癮棆瘴", 30214)};
      IIoI = new String[]{Iloo("癄梆瘪", 30214), Iloo("眗棶", 30214)};
      IIol = new String[]{Iloo("癏癑瘡瘎", 30214), Iloo("癥癍瘫", 30214)};
      IIo1 = new String[]{Iloo("癏癑瘡瘎", 30214), Iloo("癨癍棩瘍", 30214)};
      IIo_ = new String[]{Iloo("癍癍瘱", 30214), Iloo("癐棔瘧", 30214)};
      I_00 = Iloo("癍癍瘱癃直桐皣", 30214);
      I_0o = Iloo("癄梆瘪癃瞓桲", 30214);
      I_o = Iloo("癏癑瘡瘎皢盏皨桲皐", 30214);
      I_oI = Iloo("癈癍棩瘍", 30214);
      I_ol = Iloo("癈癍棩瘍皢盕桥皫", 30214);
      I_o1 = Iloo("癎盆瘽癃瞓栞皮盿皈槖眜眯眈睴瞘瞴瞞曎硄硳砜磹硑碶磎祹神禡礄禩秊杤禈稥笵撐穂箐摣窟窲稝筱笛笴笑篱数箻篕籢拖", 30214);
      I_o_ = Iloo("療盅瘪瘋皢盂皨皰盞睉睎瞺眓瞹皨楲瞂砟", 30214);
      I_oO = Iloo("療盅瘪瘋皢盂皨皰盞睓睝眶槅矺瞲", 30214);
      I_o0 = Iloo("療盅瘪瘋皢盂皨皰盞睅睝眢眞矸瞲", 30214);
      I_oo = Iloo("癕棌瘧癃盯栀皮皷盞睤矖眮睚矺椟瞢", 30214);
      IO = Iloo("癕棌瘧癃盯栀皮皷盞睾槛眺睚矻椙瞹", 30214);
      IOI = Iloo("眖盆癤瘇登盏皧", 30214);
      IOII = Iloo("盲", 30214);
      IOIl = Iloo("癈盇瘪瘄皢盂桥皯", 30214);
      IOI1 = Iloo("眖癄瘪瘄皢盏瘢皱皙眽睟槾眊", 30214);
      IOI_ = Iloo("癁盄瘪癃癶皫皰皷瘓睰眜眯槕短", 30214);
      IOIO = Iloo("癐盅瘫癃癶皫皴皷栗眽", 30214);
      IOI0 = Iloo("癅梀瘰癃直癁皯盕皌皭皝眵眝", 30214);
      IOIo = Iloo("癅梀瘰癃直癁皯盿皌皭皝眵眝", 30214);
      IOl = Iloo("癈盖瘭癃盡盉皵皦根睳", 30214);
      IOlI = Iloo("癎检瘰", 30214);
      IOll = Iloo("癅癍瘫", 30214);
      IOl1 = Iloo("癈癍棩瘍", 30214);
      IOl_ = Iloo("癈癍棡瘍皢皓盠皳桙睳", 30214);
      IOlO = Iloo("癅盖癤瘗盪桢盠皫皖睨眜眳眕椸矛瞿", 30214);
      IOl0 = Iloo("癈癍棡瘍皢相盠矎栽眽瘭榈眔矾瞘眪矖砽", 30214);
      IOlo = Iloo("癈癍棡瘍皢皂盠矎栽眽瘭榈眔矾瞘眪矖砽", 30214);
      IO1 = Iloo("癞癌瘪癃盩盉栟皶盞瘌槥眵眝瞹矔楶瞟砵硓砲砟磴碐秞昭礭祏柦礚禩秆禯杋穱稄稧撍窡竌竖搙窈", 30214);
      IO1I = Iloo("眖癄瘪瘄皢盎皮皳皗睳睙", 30214);
      IO1l = Iloo("眖癄瘪瘄皢盎皦皹皒睴睒眾", 30214);
      IO11 = Iloo("癍梚瘰癃盠栀皮", 30214);
      IO1_ = Iloo("癅癍瘥瘗皢监皬皾皇睸睎", 30214);
      IO1O = Iloo("癅癍瘥瘗皢盗栛皶", 30214);
      IO10 = Iloo("癅癄瘴瘐盷盍皥盿皝睵睓睻眘矸矖瞰", 30214);
      IO1o = Iloo("癅癄瘴瘐盷盍皥盿皝矼眜眵眒睻矖", 30214);
      IO_ = Iloo("癅癄瘴瘐盷盍皥盿皜睼睒眼", 30214);
      IO_I = Iloo("癅癍瘫癃瞓栌皵", 30214);
      IO_l = Iloo("癈癍棩瘍皢瞰桭皪", 30214);
      IO_1 = Iloo("癞癌瘪癃瞓栌皵", 30214);
      IO__ = Iloo("瘦癉棣瘍", 30214);
      IO_O = Iloo("眖盆癤瘍盪栌皮", 30214);
      IO_0 = Iloo("癕棌瘧癃盯栀皮皷", 30214);
      IO_o = Iloo("癈療皤瘚皢盆皩皾盞睳睔槶眊", 30214);
      IOO = Iloo("癄癄瘪瘄皢盂皨核", 30214);
      IOOI = Iloo("癖癍皷癃盠盀皮皸", 30214);
      IOOl = Iloo("眖癌梇瘎皢盒栩皼盞睰榝眵眒", 30214);
      IOO1 = Iloo("癒癍皤瘍盪皁皶皶瘔睳", 30214);
      IIoO = new String[]{Iloo("癒癍皤瘍盪", 30214), Iloo("癰癌皮瘍", 30214)};
      IIo0 = new String[]{Iloo("癅癍瘥瘗", 30214), Iloo("癤癄瘪瘄", 30214)};
      IIoo = new String[]{Iloo("癔棸瘭", 30214), Iloo("癤癄瘪瘄", 30214)};
      Il = new String[]{Iloo("癊梈瘴", 30214), Iloo("癤癄瘪瘄", 30214)};
      IlI = new String[]{Iloo("癒盉瘩", 30214), Iloo("癤癄瘪瘄", 30214)};
      IlII = new String[]{Iloo("癍癍棭瘖", 30214), Iloo("癮癌梃瘖", 30214)};
      IlIl = new String[]{Iloo("癄癌梇瘖", 30214), Iloo("癲瞕梧瘍盥", 30214)};
      IlI1 = new String[]{Iloo("癞癌瘪", 30214), Iloo("眗梈瘱", 30214)};
      IOO_ = Iloo("癅梀瘴", 30214);
      IOOO = Iloo("癈療皤瘚皢盕皨瘿皐睵眜眷槗矩瞂矷", 30214);
      IOO0 = Iloo("療癄瘪瘋皢盒瘡皼皖眽睞眺眔矾", 30214);
      IOOo = Iloo("癅癍矴瘂皢盗瘠皰盞睿睝眵眝", 30214);
      IlI_ = new String[]{
         Iloo("癎癌梃瘍皢盕桡皶盞睿睝眵眝瞹矛瞿椿砵硗碠", 30214),
         Iloo("瘦瘔癤瘗盪癁皮皷盞睫睕瞱眔瞹矔眷矖硷暕砽硜", 30214),
         Iloo("瘦白瘭瘍皢盂皨栂盞睾矏睻眔矾瘈椊瞟砵硌砺砜碱磆砯碁礣", 30214),
         Iloo("瘦癧棥瘍皢盂瘳盿皊睵槿睻眙矱極瞹矖硣磔砼硒磿磘砭碀礭祚柦礞", 30214),
         Iloo("瘦癎瘬皂盡皁矑栜盞睰槡眲睚矱極矷瞀磵硛硳砐磰磞碨", 30214)
      };
      IO0 = Iloo("癈癍棩瘓皢盕瘪皱盞睿睝眵眝", 30214);
      IO0I = Iloo("癒盏瘪癃盠盀皮皸", 30214);
      IO0l = Iloo("癅癍瘥瘗皢盃皡皱皙", 30214);
      IO01 = Iloo("癈癍棩瘓皢盕瘪皱盞睿睝眵眝瞹矛楰瞘砵础曲砝", 30214);
      IO0_ = Iloo("癈癍棩瘓皢益皨桶皋眽睔眲榽矬瞘瞵瞗硻硓", 30214);
      IO0O = Iloo("癄梄瘪癃盡癒盠皲皋槌睒睻眂矰矖矷瞀磵硛硳砐磰磞碨磎", 30214);
      IO00 = Iloo("癅癍梉瘍皢盃皩栜皋眽睈盫榙矷矟矷瞔硴硚破", 30214);
      IO0o = Iloo("癞癌瘪癃直癁皯盕皜睼睒眼", 30214);
      IOo = Iloo("癞癀瘩癃盶盉瘠皱皖眗睊眲瞐矷", 30214);
      IOoI = Iloo("癖癍瘫瘍盥皫皰皷瘍眽睞眺眔矾", 30214);
      IOol = Iloo("癖癍瘫瘍盥皫皣皷栙眽睞眺眔矾", 30214);
      IOo1 = Iloo("癅梊瘰癃盡盉栩皼", 30214);
      IOo_ = Iloo("癊癊棥瘊皢盕皨瘿皐睵眜眭眓睳矖", 30214);
      IOoO = Iloo("癄梄瘪癃盪療皹盿皐睵榑眫睚短睒瞹矖硷硕砽砕", 30214);
      IOo0 = Iloo("癄梄瘪癃盪療皹盿皐睵榑眫睚矲矐楾瞃砵硜砺暵磤碐碭碏祣祋", 30214);
      IOoo = Iloo("癍癍皰瘍盥皁皴瘳皓眽睈眳槟矠瞘瞵瞗硻硓", 30214);
      I0 = Iloo("癲癗矴梸盡", 30214);
      I0I = Iloo("眖癄瘪瘄皢盕瘬皲盞睿睝眵眝", 30214);
      I0II = Iloo("癁癌瘥瘌皢盅栋皼皖", 30214);
      I0Il = Iloo("瘦癆瘬矓監皁皫皷瘍睼眜眼眓矸矗矷瞒曞硗砻", 30214);
      I0I1 = Iloo("癅癍矴瘂皢益皨瘬皟眽睛眲眛矶瞘瞳椽硶硜", 30214);
      I0I_ = Iloo("瘦眴皧癃盩盉瘳皾盞睺睕眺眕瞹矜検瞕硽", 30214);
      I0IO = Iloo("眖盆癤瘈盪癒皡盿皙睴睝眴睚矽楳瞴瞞", 30214);
      I0I0 = Iloo("癍癍皷瘂皢盆皩皾皑眽睘榐眙矱", 30214);
      IIO0 = Iloo("癅癍梙癃瞓桰皩盿皊睵槛睻眑矱睋瞶", 30214);
      I0Io = Iloo("癈癍棡瘗皢盏瘺皫盞眺睤眴眔矾瞟", 30214);
      I0l = Iloo("癞癊瘪瘄", 30214);
      I0lI = Iloo("眖棴瘭癃盲盉睰睾皐睺", 30214);
      I0ll = Iloo("癄梄瘪", 30214);
      I0l1 = Iloo("癍癍皷瘂", 30214);
      I0l_ = Iloo("癕棴癤瘗盫桠皮盿皙睴睝眴睚矽楳瞴瞞", 30214);
      I0lO = Iloo("癊梀瘽癃盰盀", 30214);
      I0l0 = Iloo("癄棪癤瘑監", 30214);
      I0lo = Iloo("癕棈癤瘇桧盏皧盕皝睵睓睑癫楞瞘瞣椛", 30214);
      I01 = Iloo("癄盄瘪", 30214);
      I01I = Iloo("癈癍棩瘓皢盒树盿皊睴槽眵睚矴矍椆瞘砵硓砺砓磾碐碫春祮祄", 30214);
      I01l = Iloo("癈癍棩瘓皢盒树盿皊睴槽眵", 30214);
      I011 = Iloo("癈癍棩瘓皢盒皡皶盞睮槭睻眎矰楹瞹矚砵硂砦砛碱磜砽碀祪礌礥礂朤秘秧禊撤積", 30214);
      I01_ = Iloo("癄梄瘪癃盩盉瘴皱皙眽瘭榼睚短矑椖瞘砹研砥砇磸碐碣砜祣祋祫礄秡朅禷秆穩撅稪", 30214);
      I01O = Iloo("癈癍棩瘓皢盒树盿皒皭槟眵眝瞹矕瞢椧硻研破砛磰磟磯碊柆祏礣", 30214);
      I010 = Iloo("癈癍棩瘓皢盒树盿皒皭槟眵眝", 30214);
      I01o = Iloo("癈癍棩瘓皢盒皡皶盞睮槭睻眖瘩楛瞹瞑砹研砥砇磸碐碣砜祣祋祫礄秡朅禷秆穩撅稪", 30214);
      I0_ = Iloo("眖盆癤瘀癱皁皶桲皊眽睌眳槓矴瞘瞹眖硬", 30214);
      I0_I = Iloo("癐癐瘭癃目癓皮皸盞睰槣睻眑矱睋瞶矖硡硆秣暩磲碐碤碆祤礌礸枇禩秌朢禈穢稄稵擏竵窀竏窶摔筱笛穋斺箸篐箿箔类簓簶抺糳糇", 30214);
      I0_l = Iloo("癡棴瘧", 30214);
      I0_1 = Iloo("癥梂瘪", 30214);
      I0__ = Iloo("眖棂", 30214);
      I0_O = Iloo("癋癌梁瘍皢监皨瘲", 30214);
      I0_0 = Iloo("癅癍梉瘍皢盗桭皫盞睭睔槲眗", 30214);
      I0_o = Iloo("癄梀瘰癃盩癍", 30214);
      I0O = Iloo("癞癌瘪癃盡盉瘠皰盟", 30214);
      I0OI = Iloo("癅梈瘱癃盯盔树皱盞睰睉眺睚矾睔矨", 30214);
      I0Ol = Iloo("癅癊瘪癃盯盔树皱盞睵槱眸睚矾睔矨", 30214);
      I0O1 = Iloo("癄梄瘪癃盡癒盠皼皖榲睟睻眗矬楩瞹矖硲硝砲砝碱磔昄碍祥礌礽枱秠禈禩禎擪穊稤穂竷損立竾窍筴斒笷筙篬篅笼箛簴籘簺粅糾糈糮糒", 30214);
      I0O_ = Iloo("癎棨瘧癃直桺皩", 30214);
      I0OO = Iloo("癋癐瘥癃盠栐皮皸", 30214);
      I0O0 = Iloo("癍癍皰瘍盥皁皴皷栽眽睈眳榋矺瞘瞿瞟曒硚硳砙磹磙磯秿祬祂礬祊秢私最禒稥穗撪稁", 30214);
      I0Oo = Iloo("癕棈癤瘇桧盏皧盕矯槞眶眰槅短瞘瞿椕硥", 30214);
      I00 = Iloo("癕棈癤瘇桧盏皧盕矯槞眶眼眓矸矗矷瞒曞硗砻", 30214);
      I00I = Iloo("癄梄瘪癃盩盉瘴皱皙眽瘭榼睚矷矟椚瞕砵礥暐硒磲磘碮碚礭祇禡礄秡禈禳禎撺稄稤程摚竉", 30214);
      I00l = Iloo("癅癍瘥瘗皢益瘪皱皖眽睈眳槅瞹矟瞾椭硼研硻硇碱磞碨昣祮礅", 30214);
      I001 = Iloo("瘦癈瘱梲盬皁皧皶皟睲眜眿榱矺矐矷瞀曎硝硳砐昰磞磣磎祯枍礥祊秪祛秧磷擖穊稤穂穼窀竔窶稉筲筜筺筆", 30214);
      I00_ = Iloo("癄梄瘪癃直桊皡盿皐矿睒眼睚矺椝瞧矖", 30214);
      I00O = Iloo("瘦癖瘥瘍盥皁皣桺皎眽", 30214);
      I000 = Iloo("癲癌梅瘎皢盏矃皱皙眽瘭槤眔瞹矯瞿瞟硦研砻暿磲", 30214);
      I00o = Iloo("眖癌梇瘎皢盕皩栞皓眽睒癘眔矾", 30214);
      I0o = Iloo("眖癌梇瘎皢盕皨瘿皐睵眜眯瞗矺矐", 30214);
      I0oI = Iloo("癲眦瘪瘄", 30214);
      I0ol = Iloo("癒眦瘪瘄", 30214);
      I0o1 = Iloo("癄梄瘪癃盡盉栉盿皝矮眜", 30214);
      I0o_ = Iloo("瘦眴瘭梠盯皁皴皶栿睰眜眵癹矷矟矹矖硝磗砪硒磽磅碶昩祣礌礿柇秹禈禳禎端穉穣筳摂窀竜稭竝稍旜筺", 30214);
      I0oO = Iloo("癄梄瘪癃盡癒盠皲皋槌睒睻眞睠矖瞰矖", 30214);
      I0o0 = Iloo("瘦癑瘭梢盯皁皮矜皐睺眜癊榹瞹矌盔瞘硲研砥碒磾碐", 30214);
      I0oo = Iloo("瘦癭瘔癃盩盉瘴皱皙眢", 30214);
      Io = Iloo("瘦癮瘍癃盩盉瘴皱皙眢", 30214);
      IoI = Iloo("瘦癖梭瘀皢瞰瘡皱皖眽睗眳瞎矷矟矨", 30214);
      IoII = Iloo("瘦癆瘬皎皢盌桡皱皙眽睗眳瞎矷矟矨", 30214);
      IoIl = Iloo("癍癍瘭癃盡癒盠", 30214);
      IoI1 = Iloo("瘦癑瘭梢盯皁皮矜皐睺眐睻眘椸矖矷瞅暨研祂秂晲磓磯碀积祂礬祊秪服禷秆穨積撆稌窡竐竗稳竝", 30214);
      IoI_ = Iloo("瘨瘅瘊瘄盭癁皩盿皌睼眜眹槛矷瞘瞴眅砵础砻暱碱磝確碏礭祮禦祊秂祅禷秆穱擏穣稷竳穔竑竾篬旟笛笲斴篻算箸箝籵籝簺", 30214);
      IoIO = Iloo("癎癵", 30214);
      IIOo = Iloo("癍癬", 30214);
      IoI0 = Iloo("癕棌瘧癃瞓癀皮皷", 30214);
      IoIo = Iloo("癁癌皥瘓", 30214);
      II0 = Iloo("癒癍梇癃目桐皣", 30214);
      Iol = Iloo("癅癍皩癃盯栀皮皸", 30214);
      IolI = Iloo("癅梀瘴癃瞓桸", 30214);
      Ioll = Iloo("癍癬癤瘗盫癋皵盿皖睼睓睡睚", 30214);
      Iol1 = Iloo("癎棶瘭癃盡盉皩瘵皋", 30214);
      II0I = Iloo("眖盆癤睲栣盕盠皼桛睭眜眯榫矰瞘盆瞗", 30214);
      II0l = Iloo("癅梀瘴癃盩栞盠皼桙睳眜", 30214);
      II01 = Iloo("癲癌梅瘎皢盏矃皱皙", 30214);
      Iol_ = Iloo("癅癍矴瘂皢盉栍皼", 30214);
      IolO = Iloo("眖棦癤瘋桏盂盠皼桙睳眜", 30214);
      Iol0 = Iloo("癎棨瘧", 30214);
      IlIl = Iloo("眗棦癤瘗瞁盏皧盿盌眭眜眓眪瞹矟椆瞕", 30214);
      Iolo = Iloo("眗棦癤瘗瞁盏皧盿盌眭眜眖眪瞹矟椆瞕", 30214);
      Io1 = Iloo("眗棦癤瘗瞁盏皧盿盏眽睏榲眙瞹矕楶瞘硽研破暣磲", 30214);
      II1 = new String[][]{
         {Iloo("癁癊瘬瘂盬", 30214), Iloo("癍癗瘭瘏目盈皮", 30214), Iloo("癟癄瘩瘀盪盀", 30214)},
         {Iloo("棖癆癤瘗盫癋皵", 30214), Iloo("癖癊瘧瘌目盍皯", 30214), Iloo("癍癄瘩瘊", 30214)},
         {Iloo("癅癄睕瘊盡", 30214), Iloo("癔癄睕瘊盡", 30214), Iloo("癍癄瘯瘂目盎皴", 30214)}
      };
      if (IO10.l_lI == 7) {
         II1 = new String[][]{
            {Iloo("癎癄瘪瘄盭", 30214), Iloo("癊癌瘪瘈盪盈", 30214), Iloo("癅癍瘥瘚監盌", 30214)},
            {Iloo("療癀瘠瘆盬", 30214), Iloo("癅癊瘨瘌目盎", 30214), Iloo("癋癌瘯瘂", 30214)},
            {Iloo("癒癄瘣瘆直盄", 30214), Iloo("療癌瘰瘑監", 30214), Iloo("癔癊瘰瘈監益皡", 30214)}
         };
      }

      Io1I = Iloo("眖森瘥癃瞓盈栃皲盞睳睔眲榽矴瞘瞡椓", 30214);
      Io1l = Iloo("癍癍皰瘍盥皁皣瘬盞睳睔眲榽矴瞘瞡椓", 30214);
      Io11 = Iloo("癎癊皤瘍皢盕皨瘿皐睵眐睻眎矱瘈椈瞘硲研", 30214);
      Io1_ = Iloo("癈癍瘭梤盯皁皶栺盞睩睔瞻眔矱瞘瞣眛硶硜", 30214);
      Io1O = Iloo("癒癗瘥瘍盥皁皢栔", 30214);
      Io10 = Iloo("癄梄瘪癃盯盔树皱盞睱矜眶睚矾睔", 30214);
      Io_I = Iloo("癅癍梉瘍皢盏睡皶盞睰睉榊眔瞹皩楨瞘", 30214);
      Io1o = Iloo("癅癍梉瘍", 30214);
      Io_ = Iloo("癅癍梉瘍", 30214);
      Io_l = Iloo("癅癍梉瘍皢瞰栃盿桗睳眜眸眒矸矌矷瞂硽暋硳砕磸晫碦", 30214);
      Io_1 = Iloo("癅癍梉瘍皢瞰栃盿皖睴槻眵睚矺矐瞶瞂砵础砻曍碱磗碦昵祤", 30214);
      lIIl = Iloo("癅癍知瘊皢盌栛皶", 30214);
      lII1 = Iloo("癅癍知瘊皢盵皋", 30214);
      lIIO = Iloo("癅癍矴瘂皢瞰矃皱皙眽睗瞦", 30214);
   }
}
